Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: when the access code is used to view an <abbr title="lasting power of attorney">LPA</abbr>
cy: pan ddefnyddir y cod mynediad i weld <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: the name of the organisation or individual the donor or attorney said they were giving that code to
cy: enw’r sefydliad neu’r unigolyn y dywedodd y rhoddwr neu’r atwrnai ei fod yn rhoi’r cod hwnnw iddo

source: This information will be shared with the donor and attorneys on the <abbr title="lasting power of attorney">LPA</abbr>, if they’re using the Use a lasting power of attorney service. This is to help prevent and detect unauthorised access.
cy: Bydd yr wybodaeth hon yn cael ei rhannu gyda’r rhoddwr a’r atwrneiod ar yr <abbr title="atwrneiaeth arhosol">LPA</abbr>, os ydynt yn defnyddio’r gwasanaeth Defnyddio atwrneiaeth arhosol. Gwneir hyn er mwyn helpu i atal mynediad anawdurdodedig a chanfod achosion o fynediad anawdurdodedig.

source: Find out more about <a class="govuk-link" href="%link%">cookies</a>.
cy: Darganfod mwy am <a class="govuk-link" href="%link%">gwcis</a>.

source: Your use of this online service is optional. If you prefer, you can ask the donor or an attorney to show you the original paper <abbr title="lasting power of attorney">LPA</abbr> or a certified copy.
cy: Mae defnyddio’r gwasanaeth ar-lein hwn yn ddewisol. Os yw’n well gennych, gallwch ofyn i’r rhoddwr neu’r atwrnai ddangos yr <abbr title="atwrneiaeth arhosol">LPA</abbr> papur gwreiddiol neu gopi ardystiedig i chi.

source: We operate the View a lasting power of attorney service as part of our legal functions under the Mental Capacity Act 2005.
cy: Rydym yn gweithredu’r gwasanaeth gweld atwrneiaeth arhosol fel rhan o’n swyddogaethau cyfreithiol o dan Ddeddf Galluedd Meddyliol 2005.

source: It may sometimes be necessary to transfer personal information overseas. Any transfers made will fully comply with all aspects of data protection law.
cy: Weithiau bydd angen trosglwyddo gwybodaeth bersonol dramor. Bydd unrhyw drosglwyddiadau a wneir yn cydymffurfio’n llawn â phob agwedd ar gyfraith diogelu data.

source: All <abbr title="Office of the Public Guardian">OPG</abbr> staff who have access to the database have MOJ security clearance.
cy: Mae gan holl staff <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> sydd â mynediad at y gronfa ddata gliriad diogelwch <abbr title="Weinyddiaeth Gyfiawnder">MOJ</abbr>.

source: Our hosting provider (Amazon Web Services) is not allowed to routinely access the secure data.
cy: Ni chaniateir i’n darparwr cynnal (Amazon Web Services) gyrchu’r data diogel fel mater o drefn.

source: If they need to do so for operational purposes, their access is strictly controlled and approved by <abbr title="Office of the Public Guardian">OPG</abbr>.
cy: Os oes angen iddynt wneud hynny at ddibenion gweithredol, mae eu mynediad yn cael ei reoli a’i awdurdodi’n llym gan yr <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr>.

source: You can find out more about how we store and use this data in <abbr title="Office of the Public Guardian">OPG</abbr>’s <a class="govuk-link" href="%link%"> personal information charter </a>.
cy: Gellir darganfod mwy am sut yr ydym yn storio ac yn defnyddio’r data hwn yn <a class="govuk-link" href="%link%">siarter wybodaeth bersonol</a> yr <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr>.

source: We will keep your personal data inline with our <a class="govuk-link" href="%link%">retention policy</a>.
cy: Byddwn yn cadw’ch data personol yn unol â’n <a class="govuk-link" href="%link%">polisi cadw</a>.

source: We’ll only share the information you give us when the law says we can. For example, we may share information with the police to help them prevent or investigate crime.
cy: Dim ond pan fydd y gyfraith yn dweud y gallwn ni rannu’r wybodaeth rydych chi’n ei rhoi i ni y byddwn yn gwneud hynny. Er enghraifft, efallai y byddwn yn rhannu gwybodaeth gyda’r heddlu i’w helpu i atal neu ymchwilio i droseddau.

source: MOJ Data Protection Officer<br> Post point 10.38<br> 102 Petty France<br> London<br> SW1H 9AJ<br>
cy: Swyddog Diogelu Data yr MOJ<br> Pwynt post 10.38<br> 102 Petty France<br> Llundain<br> SW1H 9AJ<br>

source: If these changes affect how your personal data is processed, We’ll take reasonable steps to let you know.
cy: Os yw’r newidiadau hyn yn effeithio ar sut mae eich data personol yn cael ei brosesu, byddwn yn cymryd camau rhesymol i roi gwybod i chi.

source: Information Commissioner's Office <br> Wycliffe House <br> Water Lane <br> Wilmslow <br> Cheshire <br> SK9 5AF <br>
cy: Swyddfa’r Comisiynydd Gwybodaeth<br> Wycliffe House<br> Water Lane<br> Wilmslow<br> Cheshire<br> SK9 5AF

source: Phone: 0303 123 1113
cy: Ffôn: 0303 123 1113

source: Textphone: 01625 545860
cy: Ffôn testun: 01625 545860

source: Monday to Friday, 9am to 4:30pm
cy: Dydd Llun i ddydd Gwener, 9am i 4:30 pm

source: Last updated: 24 May 2019
cy: Diweddarwyd ddiwethaf: 24 Mai 2019

source: Start again to view an LPA
cy: Dechrau eto i weld LPA

source: You'll have to start again
cy: Bydd yn rhaid i chi ddechrau eto

source: As you have not used the service for 30 minutes, we've cleared any information you entered.
cy: Gan nad ydych wedi defnyddio’r gwasanaeth ers 30 munud, rydym wedi clirio unrhyw wybodaeth a roddwyd gennych.

source: To view an LPA, you'll need to start again.
cy: I weld LPA, bydd yn rhaid ichi ddechrau eto.

source: Start again
cy: Dechrau eto

source: Accessibility statement for View a lasting power of attorney
cy: Datganiad hygyrchedd ar gyfer y gwasanaeth Gweld atwrneiaeth arhosol

source: If you cannot use this service, you can ask to see the paper version of the LPA.
cy: Os na allwch ddefnyddio’r gwasanaeth hwn, gallwch ofyn am weld fersiwn bapur yr atwrneiaeth arhosol.

source: Find out more about <a class="govuk-link" href="https://www.gov.uk/government/publications/lasting-power-of-attorney-valid-examples">checking a paper LPA</a>
cy: Gwybod mwy am <a class="govuk-link" href="https://www.gov.uk/government/publications/lasting-power-of-attorney-valid-examples.cy">wirio atwrneiaeth arhosol ar bapur</a>

source: This service is fully compliant with the <a class="govuk-link" href="https://www.w3.org/TR/WCAG21/">Web Content Accessibility Guidelines version 2.1</a> AA standard.
cy: Mae’r gwasanaeth hwn yn cydymffurfio’n llawn â safon AA <a class="govuk-link" href="https://www.w3.org/TR/WCAG21/">fersiwn 2.1 y Canllawiau ar gyfer Hygyrchedd Cynnwys ar y We</a>.

source: This service was last tested on 4 June 2020. The test was carried out by Digital Accessibility Centre (DAC).
cy: Profwyd y gwasanaeth hwn ddiwethaf ar y 4 Mehefin 2020. Cynhaliwyd y prawf gan y Ganolfan Hygyrchedd Digidol (DAC).

# flashMessage
source: Password changed successfully
cy: Cyfrinair wedi’i newid yn llwyddiannus

# flashMessage
source: Email address changed successfully
cy: Cyfeiriad ebost newid yn llwyddiannus

# flashMessage
source: Account activated successfully
cy: Cyfrif wedi’i actifadu’n llwyddiannus

# flashMessage
source: health and welfare
cy: iechyd a lles

# flashMessage
source: property and finance
cy: eiddo a materion ariannol

# flashMessage
source: You've removed %donor%'s %lpaType% LPA
cy: Rydych wedi tynnu atwrneiaeth arhosol %donor% ar gyfer %lpaType%

source: Give %organisation% this access code. They should go to <a href="%link_en%" class="govuk-link">www.gov.uk/view-lpa</a> to enter the access code and see a summary of the <abbr title="lasting power of attorney">LPA</abbr>. %organisation% may still ask to see the paper LPA.
cy: Rhowch y cod mynediad hwn i %organisation%. Dylent fynd i <a href=%link_cy% class=“govuk-link”>www.gov.uk/gweld-atwrneiaeth-arhosol</a> i roi’r cod mynediad a gweld crynodeb o’r atwrneiaeth. Efallai y bydd %organisation% yn dal i ofyn am weld yr LPA bapur.

source: Scanned copies of the donor’s preferences and instructions will be shown in the LPA summary. You’ll need to show organisations the paper LPA if any part of these cannot be read properly.
cy: Wedi eu sganio o ddewisiadau a gyfarwyddiadau’r rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: Scanned copies of the donor’s preferences will be shown in the LPA summary. You’ll need to show organisations the paper LPA if any part of these cannot be read properly.
cy: Wedi eu sganio o ddewisiadau rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: Scanned copies of the donor’s instructions will be shown in the LPA summary. You’ll need to show organisations the paper LPA if any part of these cannot be read properly.
cy: Wedi eu sganio o gyfarwyddiadau’r rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: Scanned copies of the donor’s preferences or instructions will be shown in the LPA summary. You’ll need to show organisations the paper LPA if any part of these cannot be read properly.
cy: Wedi eu sganio o ddewisiadau neu gyfarwyddiadau’r rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: By continuing, you are agreeing to the <a href="%link_en%" class="govuk-link">terms of the Use a lasting power of attorney service.</a>
cy: Trwy barhau, rydych yn cytuno i <a href=%link_cy% class="govuk-link"> delerau’r gwasanaeth Defnyddio atwrneiaeth arhosol.</a>
