Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: activation key has expired or has already been used - you can <a href="%link%" class="govuk-link">request a new key</a>
cy: mae’r allwedd cadarnhau wedi did i ben neu wedi cael ei defnyddio’n barod - gallwch chi <a href="%link%" class="govuk-link">ofyn am allwedd newydd</a>

source: date of birth you entered does not match our records
cy: dydy’r dyddiad geni rydych chi wedi’i roi ddim yn cyfatb i’n cofnodion ni

source: LPA reference number you entered is incorrect or for a different LPA
cy: mae cyfeirnod yr atwrneiaeth arhosol (LPA) rydych wedi’i roi yn anghywir, neu mae’r cyfeirnod yn ymwneud ag atwrneiaeth arhosol wahanol

source: Activation Key
cy: Allwedd cadarnhau

source: Email
cy: E-bost

source: Telephone
cy: Ffonio

source: Telephone: <a class="govuk-link" href="tel:03004560300">0300 456 0300</a><br> Textphone: 0115 934 2778 <br> Monday to Friday, 9:00am to 5pm, except Wednesday, 10am to 5pm
cy: Ffôn (yn Saesneg): <a class="govuk-link" href="tel:03004560300">0300 456 0300</a><br> Ffôn testun: 0115 934 2778 <br> Dydd Llun i ddydd Gwener, 9.00am tan 5pm, heblaw bob dydd Mercher 10am tan 5pm

source: Find out about call charges
cy: Gwybodaeth am brisiau galwadau

source: Sending an activation key
cy: Teipiwch eich allwedd cadarnhau cyfrif

source: We're posting you an activation key
cy: Rydym yn anfon allwedd cadarnhau cyfrif atoch drwy’r post

source: We'll send you a letter with your activation key for this LPA. We'll post it to the address we have for you. We send it by post because it's more secure.
cy: Byddwn yn anfon llythyr atoch gyda’ch allwedd cadarnhau cyfrif ar gyfer yr atwrneiaeth arhosol hon. Byddwn yn ei phostio i’r cyfeiriad sydd gennym ar eich cyfer chi. Byddwn yn ei hanfon drwy’r post oherwydd bod hynny’n fwy diogel.

source: You should get the letter by %date%
cy: Dylech gael y llythyr erbyn %date%

source: If you do not get it by this date, please contact us. You'll need to give us the LPA reference number when you call.
cy: Os nad yw’n cyrraedd erbyn y dyddiad hwn, cysylltwch â ni. Bydd angen ichi roi cyfeirnod yr LPA inni pan fyddwch yn ffonio.

source: Sign in to your Use a lasting power of attorney account
cy: Mewngofnodi i’ch cyfrif Defnyddio atwrneiaeth arhosol

source: Sign in or <a href="%link%" class="govuk-link">create an account</a>.
cy: Mewngofnodi neu <a href="%link%" class="govuk-link">greu cyfrif</a>.

source: If you made an <abbr title="lasting power of attorney"> LPA </abbr> online, you'll still need to create an account on this service to use the LPA online.
cy: Os ydych chi wedi gwneud <abbr title="atwrneiaeth arhosol"> LPA </abbr> ar-lein, bydd dal angen i chi greu cyfrif ar y gwasanaeth hwn er mwyn defnyddio’r LPA ar-lein.

source: If you want to make an LPA online go to the <a class="govuk-link" href=%link%>Make a lasting power of attorney service.</a>
cy: Os ydych chi eisiau gwneud atwrneiaeth arhosol ar-lein, ewch i <a class="govuk-link" href=%link%>Gwasanaeth gwneud atwrneiaeth arhosol.</a>

source: Forgotten your password?
cy: Wedi anghofio eich cyfrinair?

source: LPA removed
cy: Mae’r LPA wedi’i dileu

source: We've removed an LPA from your account
cy: Rydym wedi dileu LPA o’ch cyfrif

source: We've removed an <abbr title="lasting power of attorney">LPA</abbr> from your account because either:
cy: Rydym wedi dileu <abbr title="atwrneiaethau arhosol">LPA</abbr> o’ch cyfrif oherwydd naill ai:

source: you can no longer act as an attorney on the <abbr title="lasting power of attorney">LPA</abbr>
cy: ni allwch weithredu fel atwrnai ar y <abbr title="atwrneiaethau arhosol">LPAs</abbr> mwyach

source: you've told us you no longer want to be an attorney
cy: rydych wedi dweud wrthym nad ydych eisiau bod yn atwrnai mwyach

source: the donor has removed you as an attorney
cy: mae’r rhoddwr wedi eich dileu fel atwrnai

source: Confirm this is the correct LPA
cy: Cadarnhewch mai dyma yw’r LPA gyw

source: (Trust corporation)
cy: (Corfforaeth Ymddiriedolaeth)

source: Your role on this LPA
cy: Eich swyddogaeth yn yr LPA hon

source: Check that these details are correct before continuing
cy: Gwiriwch fod y manylion hyn yn gywir cyn mynd ymlaen

source: What to do if the details are wrong
cy: Beth i’w wneud os yw’r manylion yn anghywir

source: If the information is wrong, or if a name is misspelt, please call us:
cy: Os yw’r wybodaeth yn anghywir, neu os yw enw wedi cael ei gamsillafu, ffoniwch ni ar:

source: Confirm
cy: Cadarnhau

# flashMessage
source: You've added %donor%'s %lpaType% LPA
cy: Rydych wedi ychwanegu atwrneiaeth arhosol %lpaType% %donor%

# flashMessage
source: You cancelled the access code for %organisation%: %code%
cy: Gwnaethoch ganslo’r cod mynediad ar gyfer %organisation%: %code%

source: Sign in to this service
cy: Mewngofnodi i’r gwasanaeth hwn

source: To make an LPA online, or to continue to make an LPA you’ve started, go to the <a href="%link%" class="govuk-link">Make a lasting power of attorney service.</a>
cy: Er mwyn gwneud atwrneiaeth arhosol ar-lein, neu i barhau ag atwrneiaeth arhosol rydych chi wedi’i dechrau yn barod, ewch i’r <a href=%link% class="govuk-link">gwasanaeth Gwneud atwrneiaeth arhosol.</a>

source: You’ll need to sign in to the Use a lasting power of attorney service using GOV.UK One Login.
cy: Bydd angen i chi fewngofnodi i’r gwasanaeth Defnyddio atwrneiaeth arhosol drwy GOV.UK One Login.

source: If you’ve not used GOV.UK One Login before, you can set up your access on the next page.
cy: Os nad ydych chi wedi defnyddio GOV.UK One Login o’r blaen, gallwch greu cyfrif ar y dudalen nesaf.

source: GOV.UK One Login is the new way to sign in to government services in one place, using the same email address and password.
cy: Gov.uk One Login yw’r ffordd newydd o fewngofnodi i wasanaethau’r llywodraeth mewn un lle, gan ddefnyddio’r un cyfeiriad e-bost a chyfrinair.

source: What if I’ve used this service before?
cy: Beth os ydw i wedi defnyddio’r gwasanaeth hwn o’r blaen?

source: If you have a Use a lasting power of attorney account from before 1 January 2024 and you use the same email address for GOV.UK One Login, any LPAs you’ve previously added will automatically appear.
cy: Os oes gennych chi gyfrif Defnyddio atwrneiaeth arhosol o 1 Ionawr 2024 ymlaen, a’ch bod yn defnyddio’r un cyfeiriad e-bost ar gyfer GOV.UK One Login, bydd unrhyw atwrneiaeth arhosol rydych chi wedi’i hychwanegu’n flaenorol yn ymddangos yn awtomatig.

source: with GOV.UK One Login
cy: gyda GOV.UK One Login

source: If you have any problems signing in to this service, you can <a href=https://home.account.gov.uk/contact-gov-uk-one-login?lng=en class="govuk-link">contact the GOV.UK One Login team</a> to get help.
cy: Os ydych yn cael unrhyw broblemau wrth fewngofnodi i’r gwasanaeth hwn, gallwch <a href=https://home.account.gov.uk/contact-gov-uk-one-login?lng=cy class="govuk-link">gysylltu â thîm One Login GOV.UK</a> i gael gymorth.

source: Check your answers
cy: Gwiriwch eich atebion

source: Change<span class="govuk-visually-hidden"> reference number</span>
cy: Newid<span class="govuk-visually-hidden"> Cyfeirnod LPA</span>

source: Change<span class="govuk-visually-hidden"> name</span>
cy: Newid<span class="govuk-visually-hidden"> Enw</span>

source: Change<span class="govuk-visually-hidden"> dob</span>
cy: Newid<span class="govuk-visually-hidden"> Dyddiad geni</span>

source: Change<span class="govuk-visually-hidden"> postcode</span>
cy: Newid<span class="govuk-visually-hidden"> Cod post</span>

source: Sign in or create an account
cy: Mewngofnodi neu greu cyfrif

source: Do you have a Use a lasting power of attorney account?
cy: A oes gennych chi gyfrif Defnyddio atwrneiaeth arhosol?

source: Yes, I already have an account
cy: Oes, mae gen i gyfrif yn barod

source: If you made an LPA online, you will still need to create an account to use this service
cy: Os gwnaethoch LPA ar-lein, bydd dal angen i chi greu cyfrif i allu defnyddio’r gwasanaeth hwn

source: No, this is the first time I’ve used the service
cy: Nac oes, hwn yw’r tro cyntaf i fi ddefnyddio’r gwasanaeth

source: If you're named on more than one LPA, you can add all those LPAs to your account.
cy: Os ydych wedi’ch enwi ar fwy nag un LPA, gallwch ychwanegu pob LPA at eich cyfrif.

source: Let us know if something is incorrect on the LPA
cy: Gadewch i ni wybod os oes rhywbeth yn anghywir ar yr LPA

source: It's important that the information on the LPA summary is correct.
cy: Mae’n bwysig bod yr wybodaeth ar y crynodeb o’r LPA yn gywir.

source: we say you added preferences and instructions when you did not
cy: rydym yn dweud eich bod wedi ychwanegu dewisiadau pan na wnaethoch hynny

source: information about life-sustaining treatment is incorrect
cy: gwybodaeth am driniaeth cynnal bywyd yn anghywir

source: the registration date or the date the donor signed the LPA are incorrect
cy: y dyddiad cofrestru neu’r dyddiad y gwnaeth y rhoddwr lofnodi’r LPA yn anghywir

source: We’ll update the online <abbr title="lasting power of attorney">LPA</abbr> summary and our records.
cy: Byddwn yn diweddaru’r crynodeb o’r <abbr title="atwrneiaethau arhosol">LPA</abbr> ar-lein a’n cofnodion.

source: Do not make any changes to the paper <abbr title="lasting power of attorney">LPA</abbr> yourself. If you do, you’ll no longer be able to use the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Peidiwch â gwneud unrhyw newidiadau i’r <abbr title="atwrneiaeth arhosol">LPA</abbr> papur eich hun. Os byddwch yn gwneud hyn, yna ni fyddwch yn gallu defnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> mwyach.

source: Contact us through any of the ways below.
cy: Cysylltwch â ni drwy unrhyw un o’r ffyrdd isod.

source: When you get in touch, you’ll need to tell us:
cy: Pan fyddwch yn cysylltu, bydd angen i chi ddweud y canlynol wrthym:

source: the LPA reference number
cy: cyfeirnod yr awtrneiaeth arhosol

source: your name
cy: eich enw

source: your role (ie, whether you are the donor or an attorney)
cy: eich rôl (p’un ai ydych chi’n rhoddwr neu’n atwrnai)

source: the donor’s name (if you are not the donor)
cy: enw’r rhoddwr (os nad chi yw’r rhoddwr)

source: the donor’s date of birth
cy: dyddiad geni’r rhoddwr

source: the donor’s address and postcode
cy: cyfeiriad a chod post y rhoddwr

source: We cannot change your email address
cy: Ni allwn newid eich cyfeiriad e-bost

source: The link we sent you to confirm your email address has expired.
cy: Mae’r ddolen a anfonwyd atoch i gadarnhau eich cyfeiriad e-bost wedi dod i ben.

source: To change your email address, sign back into your account and ask us to change it again.
cy: I newid eich cyfeiriad e-bost, mewngofnodwch i’ch cyfrif eto a gofynnwch eto i ni ei newid.

source: You have 48 hours to confirm your email address by using the link we send you.
cy: Mae gennych 48 awr i gadarnhau eich cyfeiriad e-bost drwy ddefnyddio’r ddolen y byddwn yn ei hanfon atoch.

source: We cannot change your password
cy: Nid oes modd i ni newid eich cyfrinair

source: The link you've clicked on is invalid or has expired.
cy: Mae’r ddolen rydych wedi clicio arni yn annilys neu wedi dod i ben.

source: Password reset links expire after 24 hours or if you ask us to reset your password again.
cy: Mae dolenni ailosod cyfrinair yn dod i ben ar ôl 24 awr neu os byddwch yn gofyn i ni ailosod eich cyfrinair eto.

source: If you've asked for a password reset more than once, make sure you clicked on the link in the most recent password reset email.
cy: Os ydych chi wedi gofyn am gael ailosod cyfrinair fwy nac unwaith, gwnewch yn siŵr eich bod wedi clicio ar y ddolen yn yr e-bost ailosod cyfrinair diweddaraf.

source: Accessibility statement
cy: Datganiad hygyrchedd

source: Accessibility statement for Use a lasting power of attorney
cy: Datganiad hygyrchedd ar gyfer y gwasanaeth Defnyddio atwrneiaeth arhosol

source: This online service is run by the <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian">Office of the Public Guardian</a>. We want as many people as possible to be able to use this service. For example, that means you should be able to:
cy: <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian.cy">Swyddfa’r Gwarcheidwad Cyhoeddus</a> s y’n rhedeg y gwasanaeth ar-lein hwn. Rydym am i gymaint o bobl â phosibl allu defnyddio’r gwasanaeth hwn. Er enghraifft, mae hynny’n golygu y dylech chi allu:

source: change colours, contrast levels and fonts
cy: newid lliwiau, lefelau cyferbyniad a ffontiau

source: zoom in up to 300% without the text spilling off the screen
cy: chwyddo hyd at 300% heb i’r testun ddiflannu oddi ar y sgrin

source: navigate most of the service using just a keyboard
cy: mynd trwy’r rhan fwyaf o’r wefan gan ddefnyddio bysellfwrdd yn unig

source: navigate most of the service using speech recognition software
cy: mynd trwy’r rhan fwyaf o’r wefan gan ddefnyddio meddalwedd adnabod lleferydd

source: listen to most of the service using a screen reader (including the most recent versions of JAWS, NVDA and VoiceOver)
cy: gwrando ar y rhan fwyaf o’r wefan gan ddefnyddio darllenydd sgrin (yn cynnwys y fersiynau diweddaraf o JAWS, NVDA a VoiceOver)

source: We’ve also made the service text as simple as possible to understand.
cy: Rydym hefyd wedi gwneud testun y wefan mor syml â phosibl i’w ddeall.

source: Get help
cy: Cael help

source: <a class="govuk-link" href="https://mcmw.abilitynet.org.uk/">AbilityNet</a> has guidance about how to:
cy: Mae cyfarwyddyd ar wefan <a class="govuk-link" href="https://mcmw.abilitynet.org.uk/">AbilityNet</a> ynglŷn â’r canlynol:

source: make your mouse easier to use
cy: gwneud eich llygoden yn haws i’w defnyddio

source: use your keyboard instead of a mouse
cy: defnyddio bysellfwrdd yn lle llygoden

source: talk to your device
cy: siarad â’ch dyfais

source: make your device talk to you
cy: gwneud i’ch dyfais siarad â chi

source: make text larger
cy: chwyddo testun

source: change your colours
cy: newid lliwiau

source: magnify the screen
cy: chwyddo’r sgrîn

source: What to do if you cannot access parts of this service
cy: Beth i’w wneud os na allwch gael mynediad at rannau o’r gwasanaeth hwn

source: If you cannot use this service, you can use the paper version of the LPA.
cy: Os na allwch ddefnyddio’r gwasanaeth hwn, gallwch ddefnyddio fersiwn bapur yr atwrneiaeth arhosol.

source: Reporting accessibility problems with this service
cy: Rhoi gwybod am broblemau hygyrchedd gyda’r gwasanaeth hwn

source: We’re always looking to improve the accessibility of this service. If you find any problems not listed on this page or think we’re not meeting accessibility requirements, please contact us.
cy: Rydym wastad yn ceisio gwella hygyrchedd y gwasanaeth hwn. Os byddwch chi’n dod o hyd i unrhyw broblemau nad ydyn nhw wedi’u rhestru ar y dudalen hon neu’n credu nad ydyn ni’n cwrdd â gofynion hygyrchedd, cysylltwch â ni.

source: Enforcement procedure
cy: Y weithdrefn orfodaeth

source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’). If you’re not happy with how we respond to your complaint, <a class="govuk-link" href="https://www.equalityadvisoryservice.com/">contact the Equality Advisory and Support Service (EASS)</a>.
cy: Mae’r Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) yn gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau ac Apiau) (Rhif 2) 2018 (y ‘rheoliadau hygyrchedd’). Os nad ydych yn hapus â sut rydym yn ymateb i’ch cwyn, <a class="govuk-link" href="https://www.equalityadvisoryservice.com/">cysylltwch â’r Gwasanaeth Cyngor a Chefnogaeth ar Gydraddoldeb (EASS)</a>.

source: Technical information about this service’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y gwasanaeth hwn

source: The Office of the Public Guardian is committed to making its online services accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.
cy: Mae Swyddfa’r Gwarcheidwad Cyhoeddus wedi ymrwymo i wneud ei gwasanaethau ar-lein yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau ac Apiau) (Rhif 2) 2018.

source: Compliance status
cy: Statws cydymffurfio

source: This service is partially compliant with the <a class="govuk-link" href="https://www.w3.org/TR/WCAG21/">Web Content Accessibility Guidelines version 2.1</a> AA standard, due to the non-compliances listed below.
cy: Mae’r gwasanaeth hwn yn cydymffurfio’n rhannol â safon AA <a class="govuk-link" href="https://www.w3.org/TR/WCAG21/">fersiwn 2.1 y Canllawiau ar gyfer Hygyrchedd Cynnwys ar y We</a> o achos methu â chydymffurfio â’r pethau a restrir isod.

source: Non-accessible content
cy: Cynnwys nad yw’n hygyrch

source: The content listed below is non-accessible for the following reasons.
cy: Nid yw’r cynnwys a restrir isod yn hygyrch am y rhesymau canlynol.

source: Non compliance with the accessibility regulations
cy: Diffyg cydymffurfio â’r rheoliadau hygyrchedd

source: Some images do not have a text alternative, so people using a screen reader cannot access the information. This fails WCAG 2.1 success criterion 1.1.1 (non-text content).
cy: Nid oes gan rai delweddau ddewis arall ar ffurf testun, felly ni all pobl sy’n defnyddio darllenydd sgrin gael mynediad at yr wybodaeth. Mae hyn yn fethiant mewn perthynas â maen prawf llwyddiant 1.1.1 (cynnwys nad yw’n destun) WCAG 2.1.

source: Some of the images provided are extractions from original paper documents. We can not provide a text alternative either via a person or OCR technology as due to the legal nature of the content this needs to be 100% accurate to the intent of the original document.
cy: Mae rhai o’r delweddau a ddarperir wedi eu tynnu o ddogfennau papur gwreiddiol. Ni allwn ddarparu dewis amgen ar ffurf testun drwy weithred unigolyn na thechnoleg OCR oherwydd natur gyfreithiol y cynnwys.

source: Disproportionate burden
cy: Baich anghymesur

source: Not applicable
cy: Amherthnasol

source: Content that’s not within the scope of the accessibility regulations
cy: Cynnwys nad yw o fewn cwmpas y rheoliadau hygyrchedd

source: Preparation of this accessibility statement
cy: Paratoi’r datganiad hygyrchedd hwn

source: This statement was prepared on %date%
cy: Paratowyd y datganiad hwn ar %date%

source: This service was last tested on 22 April 2022. The test was carried out by Digital Accessibility Centre (DAC).
cy: Profwyd y gwasanaeth hwn ddiwethaf ar yr 22 ain o Ebrill 2022. Cynhaliwyd y prawf gan y Digital Accessibility Centre (DAC).

source: Which organisation do you want to give access to
cy: Pa sefydliad ydych chi eisiau rhoi mynediad iddo

source: Which organisation do you want to give access to?
cy: Pa sefydliad ydych chi eisiau rhoi mynediad iddo?

source: The organisation could be a hospital, care home, or other health care provider. This is for your reference only
cy: Gallai’r sefydliad fod yn ysbyty, cartref gofal neu ddarparwr gofal iechyd arall. I chi gyfeirio ato yn unig mae hyn

source: The organisation could be a bank, energy provider, or another business. This is for your reference only
cy: Gallai’r sefydliad fod yn fanc, darparwr ynni, neu’n fusnes arall. I chi gyfeirio ato yn unig mae hyn

source: Organisation name
cy: Enw’r sefydliad

source: Check that the organisation will accept an online summary of the <abbr title="lasting power of attorney">LPA</abbr> and how they want to receive the access code you make for them.
cy: Gwiriwch a fydd y sefydliad yn derbyn crynodeb ar-lein o’r <abbr title="atwrneiaethau arhosol">LPA</abbr> a sut maen nhw eisiau cael y cod mynediad y byddwch yn ei greu iddynt.

source: This LPA has instructions.<br>
cy: Mae gan yr LPA hon gyfarwyddiadau.<br>

source: You might need to show organisations the paper LPA.
cy: Efallai y bydd angen i chi ddangos LPA papur i sefydliadau.

source: Read more
cy: Darllen mwy

source: This LPA has preferences.<br>
cy: Mae gan yr LPA hon ddymuniadau.<br>

source: This LPA has instructions and preferences.<br>
cy: Mae gan yr LPA hon gyfarwyddiadau neu ddymuniadau.<br>

source: This LPA has instructions and/or preferences.<br>
cy: Mae gan yr LPA hon gyfarwyddiadau a/neu ddymuniadau.<br>

source: You are not an attorney on this <abbr title="lasting power of attorney">LPA</abbr> anymore.
cy: Nid ydych yn atwrnai ar yr <abbr title="lasting power of attorney">LPA</abbr> hon mwyach.

source: Why is this?
cy: Beth yw’r rheswm dros hyn?

source: cancelled
cy: dilëwyd

source: %count% active code
cy: %count% codau i’w defnyddio

source: No active codes
cy: Dim codau yn weithredol

source: View LPA summary
cy: Gweld crynodeb LPA

source: Remove LPA
cy: Dileu LPA

source: VIEWED
cy: GWELD

source: NOT VIEWED
cy: HEB WELD LPA

source: Access code expires in %count% day
cy: Bydd eich cod mynediad yn dod i ben mewn %count% diwrnod

source: Access code cancelled %date%
cy: Canslwyd eich cod mynediad ar %date%

source: Access code expired %date%
cy: Daeth eich cod mynediad i ben ar %date%

source: Access code
cy: Cod mynediad LPA

source: Created by
cy: Crëwyd gan

source: LPA viewed
cy: Wedi gweld LPA

source: Viewed
cy: Gweld

source: %organisation% on %date%
cy: %organisation% ar %date%

source: Not viewed
cy: Heb weld LPA

source: Expires
cy: Daw i ben

source: Expired
cy: Wedi dod i ben

source: Status
cy: Statws

source: CANCELLED
cy: DILËWYD

source: EXPIRED
cy: WEDI DOD I BEN

source: We’re about to sign you out
cy: Rydym ar fin eich allgofnodi

source: For your security, we’ll sign you out of this service in <span id="time">5</span> minutes.
cy: Byddwn yn eich allgofnodi o’r gwasanaeth hwn mewn <span id="time">5</span> munud am resymau diogelwch.

source: Stay signed in
cy: Parhau i ddefnyddio’r gwasanaeth

source: Your <a class="govuk-link" href="{link}" target="_blank">feedback<span class="govuk-visually-hidden">(opens in new tab)</span></a> will help us to improve
cy: Bydd eich <a class="govuk-link" href="{link}" target="_blank">adborth<span class="govuk-visually-hidden">(yn agor mewn tab newydd)</span></a> yn ein helpu wella

source: Cancel organisation's access
cy: Canslo mynediad sefydliad

source: This LPA has instructions or preferences. You might need to show organisations the paper LPA.
cy: Mae gan yr LPA hon gyfarwyddiadau neu ddymuniadau. Efallai y bydd angen i chi ddangos LPA papur i sefydliadau.

source: This LPA has instructions. You might need to show organisations the paper LPA.
cy: Mae gan yr LPA hon gyfarwyddiadau. Efallai y bydd angen i chi ddangos LPA papur i sefydliadau.

source: This LPA has preferences. You might need to show organisations the paper LPA.
cy: Mae gan yr LPA hon ddymuniadau. Efallai y bydd angen i chi ddangos LPA papur i sefydliadau.

source: This LPA has instructions and preferences. You might need to show organisations the paper LPA.
cy: Mae gan yr LPA hon gyfarwyddiadau a ddymuniadau. Efallai y bydd angen i chi ddangos LPA papur i sefydliadau.

source: This service will be unavailable between 9pm on Friday 31st March 2023 and 9:30am on Saturday 1st April 2023.
cy: Ni fydd y gwasanaeth hwn ar gael rhwng 9pm ar Ddydd Gwener 31 Mawrth hyd 9:30am ar Ddydd Sadwrn 1 Ebrill.

source: If you need to use your lasting power of attorney during this time you can still use the paper LPA document.
cy: Os mae arnoch angen defnyddio eich atwrneiaeth arhosol yn ystod y cyfnod hwn gallwch dal ddefnyddio’r copi papur o’r LPA.

source: Let us know if a donor or attorney’s details change
cy: Rhowch wybod inni os bydd manylion rhoddwr neu atwrnai yn newid
