Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

# error
source: The LPA reference number you entered is too short
cy: Mae’r cyfeirnod LPA y bu i chi ei nodi yn rhy fyr

# error
source: The LPA reference number you entered is too long
cy: Mae’r cyfeirnod LPA y bu i chi ei nodi yn rhy hir

# error
source: Enter the LPA reference number in the correct format
cy: Nodwch y cyfeirnod LPA yn y fformat cywir

# error
source: Enter your date of birth
cy: Teipiwch eich dyddiad geni

# error
source: Date of birth must be a real date
cy: Rhaid i’r dyddiad geni fod yn ddyddiad dilys

# error
source: Date of birth must include a day
cy: Rhaid i ddyddiad geni gynnwys diwrnod

# error
source: Date of birth must include a month
cy: Rhaid i ddyddiad geni gynnwys mis

# error
source: Date of birth must include a year
cy: Rhaid i ddyddiad geni gynnwys blwyddyn

# error
source: Date of birth must be in the past
cy: Rhaid i’r dyddiad geni fod yn y gorffennol

# error
source: Check your date of birth is correct - you cannot be an attorney or donor if you’re under 18
cy: Gwnewch yn si_r bod eich dyddiad geni yn gywir - ni allwch fod yn atwrnai neu’n rhoddwr os ydych o dan 18 oed

# error
source: Select if you have an activation key to add an LPA
cy: Dewiswch os oes gennych allwedd cadarnhau cyfrif i ychwanegu LPA

# error
source: The LPA reference number provided is not correct
cy: Nid yw’r cyfeirnod LPA a ddarparwyd yn gywir

# error
source: Enter the 12 numbers of the LPA reference number. Do not include letters or other characters
cy: Nodwch 12 rhif y cyfernod LPA. Peidiwch â chynnwys llythrennau neu nodau eraill

# error
source: Enter your first names
cy: Nodwch eich enwau cyntaf

# error
source: Enter your last name
cy: Nodwch eich enw olaf

# error
source: Enter your postcode
cy: Nodwch eich cod post

# error
source: Select if you live in the UK or do not live in the UK
cy: Dewiswch os ydych chi’n byw yn y DU ai peidio

# error
source: Enter your address
cy: Nodwch eich cyfeiriad

# error
source: Enter your town or city
cy: Nodwch eich tref neu ddinas

# error
source: Select whether you are the donor or an attorney on the LPA
cy: Dewiswch ai chi yw’r rhoddwr neu’r atwrnai ar yr atwrneiaeth arhosol

# error
source: Either enter your phone number or check the box to say you cannot take calls
cy: Rhowch eich rhif ffôn neu ticiwch y blwch i ddweud na allwch dderbyn galwadau

# error
source: Enter the donor's first names
cy: Rhowch enw’r rhoddwr

# error
source: Enter the donor's last name
cy: Rhowch enw olaf y rhoddwr

# error
source: Enter the donor's date of birth
cy: Rhowch ddyddiad geni’r rhoddwr

# error
source: Enter your address on the paper LPA
cy: Rhowch y cyfeiriad sydd ar yr atwrneiaeth arhosol bapur

# error
source: Enter the attorney's first names
cy: Rhowch enwau cyntaf yr atwrnai

# error
source: Enter the attorney's last name
cy: Rhowch enw olaf yr atwrnai

# error
source: Enter the attorney's date of birth
cy: Rhowch ddyddiad geni’r atwrnai

# error
source: Select whether this is the same address as your address on the paper LPA
cy: Dewiswch ai dyma’r un cyfeiriad â’r cyfeiriad sydd ar yr atwrneiaeth arhosol bapur

# error
source: Enter an organisation name
cy: Nodwch enw sefydliad

# error
source: Enter your current password
cy: Teipiwch eich cyfrinair cyfredol

# error
source: Current password is incorrect
cy: Mae’r cyfrinair cyfredol yn anghywir

# error
source: Enter your new password
cy: Teipiwch eich cyfrinair newydd

# error
source: New password and confirm new password do not match
cy: Nid yw eich cyfrinair newydd a’r cyfrinair i gadarnhau eich cyfrif yn cyfateb

# error
source: Enter your password again to confirm it
cy: Teipiwch eich cyfrinair eto i’w gadarnhau

# error
source: Confirm your email address
cy: Cadarnhau eich cyfeiriad e-bost

# error
source: The emails did not match
cy: Nid oedd y cyfeiriadau e-bost yn cyfateb

source: Request an activation key
cy: Gofynnwch am allwedd actifadu

source: You can only ask for an activation key if:
cy: Ni allwch ond gofyn am allwedd cadarnhau:

source: you're a donor or an attorney on the LPA (not a replacement attorney)
cy: os ydych yn rhoddwr neu’n atwrnai ar yr LPA (nid yn atwrnai cyfnewid)

source: the LPA was made for use in England and Wales
cy: gwnaed yr atwrneiaeth arhosol i’w defnyddio yng Nghymru a Lloegr

source: You cannot ask for a key for:
cy: Ni allwch ofyn am allwedd ar gyfer:

source: LPAs with reference numbers fewer than 12 digits and registered before January 2016
cy: Cyfeirnod yr LPA gyda chyfeirnodau llai na 12 digid ac wedi’u cofrestru cyn mis Ionawr 2016

source: enduring powers of attorney (EPAs)
cy: Atwrniaethau parhaus (EPA)

source: LPAs registered by the Office of the Public Guardian Scotland
cy: atwrneiaethau arhosol a gofrestrwyd gan Swyddfa’r Gwarcheidwad Cyhoeddus yn yr Alban

source: What you'll need
cy: Beth fydd ei angen arnoch

source: To ask for a key, you'll need to give us:
cy: I ofyn am allwedd, bydd angen i chi roi’r canlynol i ni:

source: your current address - all activation keys are sent by post
cy: eich cyfeiriad presennol - anfonir pob allwedd cadarnhau cyfrif drwy’r post

source: the LPA reference number - you'll find this on the paper LPA and on letters from the Office of the Public Guardian (OPG)
cy: cyfeirnod yr atwrneiaeth arhosol - fe welwch hwn ar yr atwrneiaeth arhosol bapur ac ar lythyrau gan Swyddfa’r Gwarcheidwad Cyhoeddus (OPG)

source: I do not know the LPA reference number
cy: Dydw i ddim yn gwybod beth yw’r cyfeirnod LPA

source: If you do not have the paper LPA or any letters from OPG, check with other people named on the LPA.
cy: Os nad yw’r atwrneiaeth arhosol bapur gennych chi nac unrhyw lythyrau gan Swyddfa’r Gwarcheidwad Cyhoeddus, holwch bobl eraill sydd wedi’u henwi ar yr atwrneiaeth arhosol.

source: On the LPA, the donor told us who they wanted the registered paper LPA sent to. This may have been the donor or an attorney. If a professional, such as a solicitor, helped to make the LPA, it may have been sent to them.
cy: Ar yr atwrneiaeth arhosol, dywedodd y rhoddwr wrthym at bwy yr hoffent i’r atwrneiaeth arhosol bapur gofrestredig gael ei hanfon. Gallai hyn fod yn rhoddwr neu’n atwrnai. Os oedd gweithiwr proffesiynol, megis cyfreithiwr, wedi helpu i wneud yr atwrneiaeth arhosol, efallai bod y ddogfen bapur wedi cael ei hanfon atyn nhw.

source: Check your details
cy: Gwiriwch eich manylion

source: Current address
cy: Cyfeiriad presennol

source: Change<span class="govuk-visually-hidden"> address</span>
cy: Newid<span class="govuk-visually-hidden"> cyfeiriad</span>

source: Address on paper LPA
cy: Cyfeiriad ar yr LPA papur

source: Not sure
cy: Ddim yn siŵr

source: Same as above
cy: Yr un peth ag uchod

source: Change<span class="govuk-visually-hidden"> address on paper LPA</span>
cy: Newid<span class="govuk-visually-hidden"> cyfeiriad ar yr LPA papur</span>

source: Your role
cy: Eich rôl

source: Change<span class="govuk-visually-hidden"> role</span>
cy: Newid<span class="govuk-visually-hidden"> rôl</span>

source: Donor's name
cy: Enw’r rhoddwr

source: Change<span class="govuk-visually-hidden"> donor's name</span>
cy: Newid<span class="govuk-visually-hidden"> enw’r rhoddwr</span>

source: Donor's date of birth
cy: Dyddiad geni’r rhoddwr

source: Change<span class="govuk-visually-hidden"> donor's date of birth</span>
cy: Newid<span class="govuk-visually-hidden"> donor’s date of birth</span>

source: Attorney's name
cy: Enw’r atwrnai

source: Change<span class="govuk-visually-hidden"> attorney's name</span>
cy: Newid<span class="govuk-visually-hidden"> enw’r atwrnai</span>

source: Attorney's date of birth
cy: Dyddiad geni’r atwrnai

source: Change<span class="govuk-visually-hidden"> attorney's date of birth</span>
cy: Newid<span class="govuk-visually-hidden"> cyfeiriad geni’r atwrnai</span>

source: Telephone number
cy: Rhif ffôn

source: Not provided
cy: Heb ei ddarparu

source: Change<span class="govuk-visually-hidden"> telephone number</span>
cy: Newid<span class="govuk-visually-hidden"> rhif ffôn</span>

source: I understand that the information I've given will be stored securely and used to process my activation key request.
cy: Rwy’n deall y bydd y wybodaeth a roddais yn cael ei storio’n ddiogel a’i defnyddio i brosesu fy nghais am allwedd cadarnhau cyfrif.

source: Confirm and submit request
cy: Cadarnhau a chyflwyno’r cais

source: What is your current postcode?
cy: Beth yw eich cod post ar hyn o bryd?

source: Where do you currently live?
cy: Ble ydych chi’n byw ar hyn o bryd?

source: We will send your activation key to you by post.
cy: Byddwn yn anfon eich allwedd cadarnhau atoch chi yn y post.

source: I live in the UK
cy: Rwy’n byw yn y DU

source: What is your UK postcode?
cy: Beth yw eich cod post yn y DU?

source: I do not live in the UK
cy: Nid wyf yn byw yn y DU

source: Attorney details
cy: Manylion yr atwrnai

source: Tell us the details of an attorney named on the LPA.
cy: Dywedwch wrthym fanylion yr atwrnai a enwir ar yr LPA.

source: If you only have one attorney, enter their details here. If you have more than one attorney, enter the details of any one of them.
cy: Os mai dim ond un atwrnai sydd gennych, rhowch ei fanylion yma. Os oes gennych fwy nag un atwrnai, nodwch eu manylion.

source: First names
cy: Enwau cyntaf

source: Last name
cy: Enw olaf

source: For example, 08 04 2004
cy: Er enghraifft, 08 04 2004

source: What is your current address?
cy: Beth yw eich cyfeiriad ar hyn o bryd?

source: We need a few extra details to make sure we have the right LPA for your activation key request.
cy: Mae angen ychydig o fanylion ychwanegol arnom i wneud yn siŵr bod gennym yr atwrneiaeth arhosol gywir ar gyfer eich cais i gael allwedd cadarnhau cyfrif.

source: Address
cy: Cyfeiriad

source: You've already given your postcode as %postcode%
cy: Rydych chi eisoes wedi rhoi eich cod post fel %postcode%

source: Address line 1
cy: Llinell 1 y cyfeiriad

source: Address line 2 (optional)
cy: Llinell 2 y cyfeiriad (dewisol)

source: Town or city
cy: Tref neu ddinas

source: County (optional)
cy: Sir (dewisol)

source: Is this the same address as your address on the paper LPA?
cy: Ai dyma’r un cyfeiriad â’r cyfeiriad sydd ar yr atwrneiaeth arhosol bapur?

source: Yes, it is the same as my address on the paper LPA
cy: Ydy, mae’r un fath â fy nghyfeiriad ar yr atwrneiaeth arhosol bapur

source: No, it is different to my address on the paper LPA
cy: Na, mae’n wahanol i’m cyfeiriad ar yr atwrneiaeth arhosol bapur

source: I am not sure if it's the same address on the paper LPA
cy: Dydw i ddim yn siŵr a yw’r un fath â fy nghyfeiriad ar yr atwrneiaeth arhosol bapur

source: What is your name?
cy: Beth yw eich enw?

source: What is your role on the LPA?
cy: Eich swyddogaeth yn yr LPA hon?

source: I am the 'donor'
cy: Fi yw’r ‘rhoddwr’

source: The donor is the person the LPA is made for. They appoint attorneys to make decisions on their behalf.
cy: Y rhoddwr yw’r unigolyn y gwneir yr LPA ar ei gyfer. Mae’n penodi atwrneiod i wneud penderfyniadau ar ei ran.

source: I am an 'attorney'
cy: Rwy’n ‘atwrnai’

source: An attorney is appointed by the donor to make decisions on the donor's behalf.
cy: Mae atwrnai yn cael ei benodi gan y rhoddwr i wneud penderfyniadau ar ran y rhoddwr.

source: I am a 'replacement attorney'
cy: Rwy’n ‘atwrnai newydd’

source: A replacement attorney is appointed by the donor to step in for an attorney if they can no longer act on the donor's behalf.
cy: Mae atwrnai wrth gefn yn cael ei benodi gan y rhoddwr i gymryd lle atwrnai os nad yw’n gallu gweithredu ar ran y rhoddwr mwyach.

source: Check if you can ask for an activation key
cy: Gofyn am allwedd cadarnhau cyfrif

source: your LPA was registered on or after 1 September 2019
cy: os cofrestrwyd eich LPA rhwng 1 Medi 2019 a 16 Gorffennaf 2020

source: Where to find the LPA registration date
cy: Lle i ddod o hyd i ddyddiad cofrestru’r LPA

source: You can find the registration date on the letter that told you the LPA had been registered, or on the stamp on the first page of the paper LPA.
cy: Mae’r dyddiad cofrestru i’w weld ar y llythyr a oedd yn dweud bod yr LPA wedi cael ei chofrestru, neu ar y stamp ar dudalen gyntaf yr LPA papur.

source: If you’re not sure when the LPA was registered, you can continue and we’ll check for you.
cy: Os nad ydych yn siŵr pryd cofrestrwyd yr LPA, fe gewch barhau ac fe wnawn ni chwilio drosoch chi.

source: LPAs registered before 1 September 2019
cy: Os cofrestrwyd yr LPA cyn 1 Medi 2019

source: If the LPA was registered before 1 September 2019, you cannot get an activation key for it. If organisations want to see the LPA, show them the paper copy.
cy: Os cofrestrwyd yr LPA cyn 1 Medi 2019, ni allwch gael allwedd cadarnhau ar ei chyfer. Os oes sefydliadau eisiau gweld yr LPA, dangoswch y copi papur iddynt.

source: Let us know if your details have changed
cy: Rhowch wybod inni os bydd manylion rhoddwr neu atwrnai yn newid

source: If we do not have your correct details, you will not be able to get an activation key.
cy: Os nad yw eich manylion cywir gennym, ni fyddwch yn gallu cael allwedd cadarnhau.

source: <a class="govuk-link" href="%link%">Let us know if your details have changed</a> and you’ve not told us.
cy: <a class="govuk-link" href="%link%">Rhowch wybod inni os yw eich manylion wedi newid</a> ac nad ydych wedi dweud wrthym.

source: We need to know if:
cy: Mae arnom angen gwybod:

source: you’ve moved house - so we can post the key to the right address
cy: os ydych wedi symud tŷ – er mwyn inni allu postio’r allwedd i’r cyfeiriad iawn

source: you’ve changed your name
cy: os ydych wedi newid eich enw

source: your name or address is spelt wrong on the LPA
cy: os cafodd eich enw neu’ch cyfeiriad eu sillafu yn anghywir ar yr LPA

source: your date of birth is wrong on the LPA
cy: yw eich dyddiad geni ar yr LPA yn anghywir

source: You cannot request an activation key if you are a replacement attorney
cy: Ni allwch wneud cais am allwedd actifadu os ydych yn gweithredu fel atwrnai wrth gefn

source: Only the donor or an active attorney can request an activation key.
cy: Dim ond y rhoddwr neu’r atwrnai gweithredol all ofyn am allwedd cadarnhau cyfrif.

source: You can only become an active attorney if one of the attorneys has stopped carrying out their role. This happens if they:
cy: Dim ond os yw un o’r atwrneiod wedi rhoi’r gorau i gyflawni ei rôl y gallwch ddod yn atwrnai gweithredol. Bydd hyn yn digwydd os ydyw:

source: have died
cy: wedi marw

source: have <a href="%link%" class="govuk-link">formally stepped down</a>(‘disclaimed their appointment’)
cy: wedi <a href="%link%" class="govuk-link">sefyll i lawr </a>(‘ymwrthod â’i benodiad’)

source: have been <a href="%link%" class="govuk-link">removed from the LPA by the donor</a>
cy: wedi cael ei <a href="%link%" class="govuk-link">dynnu o’r LPA</a>gan y rhoddwr

source: have lost mental capacity
cy: wedi colli galluedd meddyliol

source: have been declared bankrupt or have a debt relief order (property and finance attorneys only)
cy: wedi’i ddatgan yn fethdalwr neu fod ganddo orchymyn rhyddhad rhag dyledion (atwrneiod eiddo a chyllid yn unig)

source: were married to, or in a civil partnership with, the donor, and the relationship has legally ended (unless the donor said otherwise in the instructions they made on the LPA)
cy: yn briod efo’r rhoddwr neu mewn partneriaeth sifil efo’r rhoddwr, ac mae’r berthynas wedi dod i ben yn gyfreithiol (oni bai bod y rhoddwr wedi dweud fel arall yn y cyfarwyddiadau a roesant ar yr LPA)

source: You must <a href="%link%" class="govuk-link">let us know if you have become an active attorney</a>. Once we’ve updated our records to show you are an active attorney, you’ll be able to request an activation key.
cy: Rhaid i chi <a href="%link%" class="govuk-link">roi gwybod i ni os ydych chi wedi dod yn atwrnai gweithredol</a>. Ar ôl i ni ddiweddaru ein cofnodion i ddangos eich bod yn atwrnai gweithredol, byddwch yn gallu gofyn am allwedd cadarnhau cyfrif.

source: What is your address on the paper LPA?
cy: Beth yw eich cyfeiriad ar yr atwrneiaeth arhosol bapur?

source: The donor's details
cy: Manylion y rhoddwr

source: Where to find the reference number
cy: Cael hyd i’ch cyfeirnod LPA

source: the reference number is on the first page of the LPA or any related letters from the Office of the Public Guardian
cy: mae’r cyfeirnod ar dudalen gyntaf yr LPA neu unrhyw lythyrau cysylltiedig gan Swyddfa’r Gwarcheidwad Cyhoeddus

source: LPA reference numbers are 12 numbers long,<br>for example: 7000-0000-0000.
cy: Mae cyfeirnodau ACLl yn 12 rhif o hyd,<br>er enghraifft: 7000-0000-0000.

source: Your lasting powers of attorney
cy: Eich atwrneiaethau arhosol

source: Important
cy: Pwysig

source: From 13 August 2024 you will only be able to sign in to your account using GOV.​UK One Login.
cy: O 13 Awst 2024 dim ond drwy ddefnyddio GOV.UK One Login y byddwch yn gallu mewngofnodi i’ch cyfrif.

source: Read about this change
cy: Darllenwch am y newid hwn

source: and how to get ready for it.
cy: a sut i baratoi ar ei gyfer.

source: Any lasting power of attorney (LPA) you add to your account will appear on this page.
cy: Bydd unrhyw atwrneiaeth arhosol (LPA) y byddwch yn ei hychwanegu at eich cyfrif yn ymddangos ar y dudalen hon.

source: Find out about <a href="%link1_en%" class="govuk-link">the role of attorney</a> and how they support donors <a href="%link2_en%" class="govuk-link">to make decisions.</a>
cy: Darganfyddwch am <a href=%link1_cy% class="govuk-link">rôl atwrnai</a> a sut maent yn cefnogi rhoddwyr <a href=%link2_cy% class="govuk-link">wneud penderfyniadau</a>.

source: What can I do with this service?
cy: Beth alla’i wneud gyda’r gwasanaeth hwn?

source: Use this service to:
cy: Defnyddiwch y gwasanaeth hwn i:

source: give organisations access to an online summary of an <abbr title="lasting power of attorney">LPA</abbr> by making a secure access code
cy: roi mynediad i sefydliadau at grynodeb ar-lein o <abbr title="atwrneiaeth arhosol">LPA</abbr> drwy greu cod diogel

source: keep track of the organisations that have online access to an <abbr title="lasting power of attorney">LPA</abbr>
cy: cadw golwg ar y sefydliadau sydd â mynediad ar-lein at <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: view an <abbr title="lasting power of attorney">LPA</abbr> summary, including a scanned image of the instructions and preferences if there are any
cy: gweld crynodeb o <abbr title="lasting power of attorney">LPA</abbr>, gan gynnwys delwedd wedi’i sganio o’r cyfarwyddiadau a’r dewisiadau os oes rhai

source: ask for an activation key if you have not been given one - or it has expired
cy: ofyn am allwedd cadarnhau cyfrif os nad ydych wedi cael un – neu os ydyw wedi dod i ben

source: Add another LPA
cy: Ychwanegu LPA arall

source: You have %count% LPA in your account
cy: Mae gennych %count% LPA ar eich cyfrif

source: Do you have an activation key to add an LPA?
cy: A oes gennych chi god i ychwanegu LPA?

source: You need your own unique activation key to add an LPA to your account. <br> Activation keys expire after 12 months.
cy: Mae angen eich allwedd cadarnhau unigryw eich hun arnoch i ychwanegu atwrneiaeth arhosol at eich cyfrif. <br> Mae allweddi cadarnhau yn dod i ben ar ôl 12 mis.

source: Activation keys are 12 letters and numbers long and start with a C, for example: C-AB12 CD34 EF56.
cy: Hyd allweddi cadarnhau yw 12 llythyren a rhif ac yn dechrau gydag C, er enghraifft: C-AB12 CD34 EF56.

source: Where can I find my activation key?
cy: Ble alla i ddod o hyd i fy allwedd cadarnhau?

source: For LPAs registered in the last 12 months
cy: Ar gyfer atwrniaethau arhosol a gofrestrwyd yn y 12 mis diwethaf

source: Your activation key is on the letter we sent you that told you the LPA had been registered.
cy: Mae eich allwedd cadarnhau ar y llythyr a anfonwyd atoch a oedd yn dweud wrthych fod yr atwrneiaeth arhosol wedi cael ei chofrestru.

source: For LPAs registered more than 12 months ago
cy: Ar gyfer atwrniaethau arhosol a gofrestrwyd dros 12 mis yn ôl

source: You have to request an activation key from us.
cy: Rhaid i chi ofyn am allwedd cadarnhau gennym ni.

source: If you’ve already requested an activation key, you'll find it on the letter or email we sent you.
cy: Os ydych chi eisoes wedi gofyn am allwedd cadarnhau, mae i’w weld ar y llythyr neu’r e-bost a anfonwyd atoch.

source: When activation keys cannot be used
cy: Pan nad oes modd defnyddio allweddi cadarnhau

source: This service cannot be used for:
cy: Ni ellir defnyddio’r gwasanaeth hwn ar gyfer:

source: You’ll need to show the paper LPA or EPA to people or organisations instead.
cy: Bydd angen i chi ddangos copi papur o’r atwrneiaeth arhosol neu’r atwrneiaeth barhaus i bobl neu sefydliadau yn lle hynny.

source: If you’ve lost your activation key, its expired, or you’ve not had one before, you can request a new one.
cy: Os ydych chi wedi colli eich allwedd cadarnhau, neu os nad ydych wedi cael un o’r blaen, gallwch ofyn am un newydd.

source: Yes, I have an activation key
cy: Oes, mae gen i allwedd cadarnhau

source: No, I need to request an activation key
cy: Na, mae angen i mi ofyn am allwedd cadarnhau

source: Delete your account
cy: Dileu eich cyfrif

source: What happens if you delete your account
cy: Beth fydd yn digwydd os byddwch yn dileu eich cyfrif

source: If you delete your Use a lasting power of attorney account:
cy: Os byddwch yn dileu eich cyfrif Defnyddio atwrneiaeth arhosol:

source: any <abbr title="lasting powers of attorney">LPAs</abbr> you added will be permanently removed
cy: bydd unrhyw atwrneiaethau arhosol yr ydych wedi’u hychwanegu yn cael eu dileu’n barhaol

source: you‘ll not be able to see how those <abbr title="lasting powers of attorney">LPAs</abbr> are being used
cy: ni fyddwch yn gallu gweld sut mae’r <abbr title="atwrneiaethau arhosol">LPAs</abbr> hynny yn cael eu defnyddio

source: You can still use paper versions of these <abbr title="lasting powers of attorney">LPAs</abbr> if:
cy: Gallwch dal ddefnyddio fersiynau papur o’r <abbr title="atwrneiaethau arhosol">LPAs</abbr> hyn:

source: the <abbr title="lasting powers of attorney">LPAs</abbr> are still valid
cy: os yw’r <abbr title="atwrneiaethau arhosol">LPAs</abbr> yn dal i fod yn ddilys

source: you have not been removed as an attorney
cy: os nad ydych wedi eich disodli fel atwrnai

source: Return to settings
cy: Dychwelyd i gosodiadau

source: Delete my account
cy: Dileu fy nghyfrif

source: Cannot send an activation key
cy: Ni allwn anfon cod ar gyfer yr LPA honno

source: We cannot send an activation key for that LPA
cy: Ni allwn anfon cod ar gyfer yr LPA honno

source: You cannot add an LPA registered before September 2019.
cy: Ni allwch ychwanegu LPA a gofrestrwyd cyn 1 Medi 2019.

source: If the LPA was registered before this date, you'll need to show the paper LPA to people and organisations instead of using this service.
cy: Os cofrestrwyd yr LPA cyn y dyddiad hwn, bydd angen i chi ddangos yr LPA papur i bobl a sefydliadau yn lle defnyddio’r gwasanaeth hwn.

source: If the paper LPA has been lost or destroyed, you can ask OPG for an office copy by calling 0300 456 0300 - office copies cost £35.
cy: Os yw’r LPA papur wedi’i cholli neu ei dinistrio, gallwch ofyn i’r OPG am gopi swyddfa drwy ffonio 0300 456 0300 - mae copi swyddfa o LPA yn costio £35.

source: Sign out
cy: Allgofnodi

source: We could not find an LPA
cy: Nid oedd modd cael hyd i LPA

source: This could be because the:
cy: Dyma’r rhesymau posibl:

source: activation key you entered is incorrect
cy: mae’r allwedd cadarnhau rydych chi wedi’i roi yn anghywir
