Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: We cannot show the instructions for this <abbr title="lasting power of attorney">LPA</abbr>. Until we can fix this problem, if you need to see these you’ll need to ask the person who gave you the access code to show you the paper <abbr title="lasting power of attorney">LPA</abbr>. You do not need to contact us. We are aware of this issue.
cy: Ni allwn ddangos y cyfarwyddiadau ar gyfer y <abbr title="atwrneiaeth arhosol">LPA</abbr> hon. Hyd nes y gallwn ddatrys y broblem hon, os byddwch angen gweld y rhain, bydd rhaid i chi ofyn i’r person a roddodd y cod mynediad i chi i ddangos y <abbr title="atwrneiaeth arhosol">LPA</abbr> bapur i chi. Nid oes angen ichi gysylltu â ni, rydym yn ymwybodol o’r mater hwn.

source: A scanned image of the donor’s instructions will appear here soon. The first time may take up to 10 minutes. Please refresh this page.
cy: Bydd delwedd wedi ei sganio o gyfarwyddiadau’r rhoddwr yn ymddangos yma’n fuan. Efallai y bydd yn cymryd hyd at 10 munud y tro cyntaf. Adnewyddwch y dudalen hon os gwelwch yn dda.

source: A scanned image of the donor’s instructions will appear here soon. The first time may take up to 10 minutes. You do not need to stay on the page or refresh it whilst you wait.
cy: Bydd delwedd wedi ei sganio o gyfarwyddiadau’r rhoddwr yn ymddangos yma’n fuan Efallai y bydd yn cymryd hyd at 10 munud y tro cyntaf. Nid oes angen ichi aros ar y dudalen nac adnewyddu’r dudalen wrth ichi aros.

source: The donor
cy: Y rhoddwr

source: Office of the Public Guardian<br> PO Box 16185<br> Birmingham<br> B2 2WH
cy: Swyddfa’r Gwarcheidwad Cyhoeddus<br> Blwch Post 16185<br> Birmingham<br> B2 2WH

source: You’ve set your cookie preferences.
cy: Rydych chi wedi gosod eich dewisiadau cwcis.

source: Go back to the page you were looking at
cy: Ewch yn ôl i’r dudalen yr oeddech yn edrych arni

source: Support links
cy: Dolenni cymorth

source: Built by OPG Digital
cy: Adeiladwyd gan OPG Digidol

source: All content is available under the <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license"> Open Government Licence v3.0 </a>, except where otherwise stated
cy: Mae’r holl gynnwys ar gael o dan <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license"> Trwydded Llywodraeth Agored v3.0 </a>, oni nodir yn wahanol

source: © Crown copyright
cy: © Hawlfraint y goron

source: Show GOV.UK One Login menu
cy: Dangos dewislen One Login GOV.UK

source: Hide GOV.UK One Login menu
cy: Cuddio dewislen One Login GOV.UK

source: Show service navigation menu
cy: Dangos dewislen llywio’r gwasanaeth

source: Hide service navigation menu
cy: Cuddio dewislen llywio’r gwasanaeth

source: Menu
cy: Dewislen

source: Close
cy: Cau

source: %service_name% menu
cy: Dewislen %service_name%

source: Your LPAs
cy: Eich LPAs

source: Last signed in:
cy: Mewngofnodwyd diwethaf:

source: Never
cy: Erioed wedi mewngofnodi

source: We’ve found this LPA
cy: Rydym wedi dod o hyd i’r LPA hwn

source: We’ve found %firstname% %surname%'s LPA
cy: Rydym wedi dod o hyd i LPA %firstname% %surname%

source: Code expires
cy: Daw’r cod i ben

source: in %count% day, on %date%
cy: mewn %count% o ddiwrnodau, ar %date%

source: If this is not the right LPA, ask the donor or attorney to check the access code.
cy: Os nad dyma’r LPA iawn, gofynnwch i’r rhoddwr neu atwrnai wirio’r cod mynediad LPA.

source: If you need to see this <abbr title="lasting power of attorney">LPA</abbr> after %date%
cy: Os oes angen i chi weld yr <abbr title="atwrneiaeth arhosol">LPA</abbr> hwn ar ôl %date%

source: You can see an online summary of this <abbr title='lasting power of attorney'> LPA </abbr>until %date%. After this date, the access code will expire.
cy: Gallwch weld crynodeb ar-lein o’r <abbr title=‘atwrneiaethau arhosol’> LPA </abbr> tan yr %date%. Ar ôl y dyddiad hwn bydd y cod mynediad yn dod i ben.

source: Ask the donor or attorney for a new access code if your organisation:
cy: Gofynnwch i’r rhoddwr neu’r atwrnai am god mynediad newydd os oes ar eich sefydliad angen:

source: needs more time to process this LPA
cy: rhagor o amser i brosesu’r LPA

source: need to see this LPA at a later date
cy: gweld yr LPA ymhellach ymlaen

source: Your organisation name
cy: Enw eich sefydliad

source: This will be displayed to the attorneys and donor on the LPA
cy: Dangosir hwn i’r rhoddwr a’r atwrneiod ar yr LPA

source: View this LPA
cy: Gweld yr LPA

source: Try another access code
cy: Ceisio defnyddio cod mynediad arall

source: Cancelled LPA access code
cy: Canclo cod mynediad LPA

source: The access code you entered has been cancelled
cy: Mae’r cod mynediad a roesoch wedi ei ganslo

source: To see this <abbr title="lasting power of attorney">LPA</abbr>, ask the donor or attorney you’re dealing with to make a new code.
cy: I weld yr <abbr title="atwrneiaeth arhosol">LPA</abbr>, gofynnwch i’r rhoddwr neu’r atwrnai yr ydych yn delio â nhw wneud cod newydd.

source: Enter another code
cy: Rhowch god arall i mewn

source: Download LPA
cy: Llwytho crynodeb o’r LPA i lawr

# error
source: Do you want to continue? You have not used this service for 30 minutes. Click continue to use any details you entered
cy: Ydych chi am barhau? Nid ydych wedi defnyddio’r gwasanaeth hwn am 30 munud. Cliciwch parhau i ddefnyddio unrhyw fanylion a roesoch

# error
source: Enter your LPA access code
cy: Rhowch eich cod mynediad LPA

# error
source: The LPA access code you entered is too long
cy: Mae’r cod mynediad LPA rydych wedi’i nodi yn rhy hir

# error
source: The LPA access code you entered is too short
cy: Mae’r cod mynediad LPA rydych wedi’i nodi yn rhy fyr

# error
source: Enter LPA access code in the correct format
cy: Rhowch god mynediad yr LPA yn y fformat cywir

# error
source: Enter your organisation name
cy: Nodwch enw eich sefydliad

source: We could not find an LPA with those details
cy: Ni lwyddwyd i ddod o hyd i LPA gyda’r manylion hynny

source: Although we could not find this LPA, it does not mean it does not exist, or is not able to be viewed somewhere else.
cy: Er na lwyddwyd i ddod o hyd i’r LPA hon, nid yw hynny’n golygu nad yw’n bodoli, neu na ellir ei gweld yn rhywle arall.

source: LPA access code
cy: Cod mynediad yr LPA

source: Did you enter the donor’s name correctly?
cy: Wnaethoch chi roi enw’r rhoddwr yn gywir?

source: You may have entered the donor’s details incorrectly. The donor is the person the LPA was made for.
cy: Efallai eich bod wedi nodi manylion y rhoddwr yn anghywir. Y rhoddwr yw’r person y gwnaed yr LPA ar ei gyfer.

source: Did you enter the LPA access code correctly?
cy: A wnaethoch chi nodi cod mynediad yr LPA yn gywir?

source: You may have entered the code incorrectly, or used another similar number instead. The access code will be given to you by an attorney or donor. It should start with a ‘V’ and be followed by 12 numbers and letters, for example, V-AB12-CD34-EF56.
cy: Efallai eich bod wedi nodi’r cod yn anghywir, neu wedi defnyddio rhif tebyg arall yn lle hynny. Bydd y cod mynediad yn cael ei roi i chi gan atwrnai neu roddwr. Dylai ddechrau gyda ‘V’ a bydd 12 rhif a llythyren yn dilyn, er enghraifft, V-AB12-CD34-EF56.

source: It should not be confused with:
cy: Ni ddylid ei gymysgu â:

source: an LPA activation key - normally sent to donors and attorneys when the LPA is registered
cy: allwedd cadarnhau cyfrif - a anfonir fel arfer at roddwyr ac atwrneiod pan fydd yr LPA wedi’i chofrestru

source: the LPA reference number - a unique number we give to each LPA
cy: cyfeirnod yr LPA - rhif unigryw a roir i bob LPA

source: Are you using the right service?
cy: Ydych chi’n defnyddio’r gwasanaeth cywir?

source: This is the View a lasting power of attorney service. It is normally used by organisations such as care homes or banks to view a summary of an LPA. They do this by using an access code sent to them by attorneys or donors.
cy: Dyma’r gwasanaeth Gweld atwrneiaeth arhosol. Fe’i defnyddir fel arfer gan sefydliadau fel cartrefi gofal neu fanciau i weld crynodeb o LPA. Maent yn gwneud hyn drwy ddefnyddio cod mynediad a anfonir atynt gan atwrneiod neu roddwyr.

source: Attorneys or donors who want to see a summary of an LPA, or give organisations access to a summary of an LPA, can do this through the <a class="govuk-link" href="https://www.gov.uk/use-lasting-power-of-attorney">Use a lasting power of attorney service</a>.
cy: Gall atwrneiod neu roddwyr sydd am weld crynodeb o LPA, neu sy’n rhoi mynediad i sefydliadau at grynodeb o LPA, wneud hyn drwy’r <a class="govuk-link" href="https://www.gov.uk/use-lasting-power-of-attorney">gwasanaeth defnyddio atwrneiaeth arhosol</a>.

source: To do this you will need your own unique LPA activation key. This is normally found on the letter that told you the LPA had been registered.
cy: I wneud hyn, bydd angen eich allwedd cadarnhau cyfrif LPA unigryw eich hun arnoch. Mae hwn fel arfer i’w weld yn y llythyr yn dweud wrthych fod yr LPA wedi’i chofrestru.

source: Enter LPA access code
cy: Rhowch god mynediad yr LPA

source: Enter the LPA access code
cy: Rhowch god mynediad LPA

source: An <abbr title="lasting power of attorney">LPA</abbr> access code is a unique code given to you by the donor or an attorney named on a lasting power of attorney.
cy: Cod unigryw yw cod mynediad <abbr title="atwrneiaeth arhosol">LPA</abbr> a roir i chi gan y rhoddwr neu atwrnai a enwir mewn atwrneiaeth arhosol.

source: Donor's last name
cy: Enw olaf y rhoddwr

source: Access codes are 13 characters long and start with a V<br/>For example, V-AB12-CD34-EF56
cy: Mae codau mynediad yn gyfuniad o 13 llythyren a rhifau ac yn dechrau gyda V<br/>Er enghraifft, V-AB12-CD34-EF56

source: The code I've been given does not begin with a V
cy: Nid yw’r cod yr wyf wedi ei gael yn dechrau efo V

source: The donor or attorney may have given you the wrong code.
cy: Efallai bod y rhoddwr neu’r atwrnai wedi rhoi’r cod anghywir i chi.

source: Ask them to go to www.gov.uk/use-lpa to create an LPA access code for your organisation.
cy: Gofynnwch iddynt fynd i www.gov.uk/defnyddio-atwrneiaeth-arhosol i greu cod mynediad LPA ar gyfer eich sefydliad.

source: By continuing you agree to our <a href="%link%" target="_blank" class="govuk-link" rel="noreferrer noopener">terms of use (opens in new tab)</a>.
cy: Ewch i’r <a href="%link%" target="_blank" class="govuk-link" rel="noreferrer noopener">Gwasanaeth gwneud atwrneiaeth arhosol </a>i wneud LPA ar-lein, neu i barhau gyda chais am LPA rydych eisoes wedi’i gychwyn.

source: Expired LPA access code
cy: Cod mynediad LPA wedi darfod

source: The access code you entered has expired
cy: Mae’r cod mynediad a roesoch wedi dod

source: Access codes expire 30 days after they’re made.
cy: Mae codau mynediad yn dod i ben ymhen 30 diwrnod ar ôl eu cynhyrchu.

source: The Use a lasting power of attorney (LPA) service lets donors and attorneys share a summary of an <abbr title="lasting power of attorney">LPA</abbr> with professionals or organisations by creating a unique ‘access code’.
cy: Mae’r gwasanaeth defnyddio atwrneiaeth arhosol (LPA) yn caniatáu i roddwyr ac atwrneiod rannu crynodeb o <abbr title="atwrneiaeth arhosol">LPA</abbr> gyda gweithwyr proffesiynol neu sefydliadau drwy greu ‘cod mynediad’ unigryw.

source: View a lasting power of attorney is the part of this service that lets you see a summary of an <abbr title="lasting power of attorney">LPA</abbr>, using the access code given to you by the donor or an attorney. This part of the service is for professionals or organisations providing a service to the donor. For example, financial institutions, medical professionals, and care organisations.
cy: Gweld atwrneiaeth arhosol yw’r rhan o’r gwasanaeth hwn sy’n caniatáu i chi weld crynodeb o <abbr title="atwrneiaeth arhosol">LPA</abbr>, gan ddefnyddio’r cod mynediad a roddwyd i chi gan y rhoddwr neu gan atwrnai. Ar gyfer gweithwyr proffesiynol neu sefydliadau sy’n darparu gwasanaeth i’r rhoddwr y mae’r rhan hon o’r gwasanaeth. Er enghraifft, sefydliadau ariannol, gweithwyr meddygol proffesiynol, a sefydliadau gofal.

source: You can use this service instead of asking to see the original paper <abbr title="lasting power of attorney">LPA</abbr>. If a donor or attorney shows you a screenshot, download or printout of an <abbr title="lasting power of attorney">LPA</abbr> summary this cannot be used as proof of an <abbr title="lasting power of attorney">LPA</abbr>. Instead, ask them to use the Use a lasting power of attorney service to make an <abbr title="lasting power of attorney">LPA</abbr> access code.
cy: Gellir defnyddio’r gwasanaeth hwn yn lle gofyn am gael gweld yr <abbr title="atwrneiaeth arhosol">LPA</abbr> wreiddiol papur. Os bydd rhoddwr neu atwrnai yn dangos llun o sgrin, neu gopi o grynodeb o <abbr title="atwrneiaeth arhosol">LPA</abbr> wedi ei lwytho neu ei argraffu oddi ar gyfrifiadur, ni ellir defnyddio hynny fel tystiolaeth o <abbr title="lasting power of attorney">LPA</abbr>. IYn hytrach, dylid gofyn iddynt ddefnyddio’r gwasanaeth Defnyddio atwrneiaeth arhosol i gynhyrchu cod mynediad <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: By using this service you:
cy: Trwy ddefnyddio’r gwasanaeth hwn rydych yn:

source: agree to these terms of use and the <a class="govuk-link" href="https://www.gov.uk/help/terms-conditions">GOV.UK terms and conditions</a>
cy: cytuno i’r telerau defnyddio hyn a <a class="govuk-link" href="https://www.gov.uk/help/terms-conditions">thelerau ac amodau GOV.UK</a>

source: confirm that a donor or attorney wants you to view the <abbr title="lasting power of attorney">LPA</abbr> and has given you an access code
cy: cadarnhau bod rhoddwr neu atwrnai eisiau i chi weld yr <abbr title="atwrneiaeth arhosol">LPA</abbr> a’i fod wedi rhoi cod mynediad i chi

source: It can be a criminal offence to use someone’s personal information without their permission.
cy: Gall defnyddio gwybodaeth bersonol rhywun heb ei ganiatâd fod yn drosedd.

source: Information security
cy: Diogelwch gwybodaeth

source: You and your organisation are responsible for your use of View a lasting power of attorney.
cy: Rydych chi a’ch sefydliad yn gyfrifol am sut y byddwch yn defnyddio’r gwasanaeth Gweld atwrneiaeth arhosol.

source: If you download a copy of an <abbr title="lasting power of attorney">LPA</abbr> summary, or record details of the summary, <b>your organisation becomes the ‘data controller’ of that information.</b> This means your organisation will be responsible for keeping the information safe and secure, in line with Data Protection Act 2018.
cy: Os byddwch yn llwytho copi o grynodeb o <abbr title="atwrneiaeth arhosol">LPA</abbr> i lawr, neu’n cofnodi manylion y crynodeb, daw’ch sefydliad yn ‘rheolwr data’ yr wybodaeth honno. Mae hyn yn golygu y bydd eich sefydliad yn gyfrifol am gadw’r wybodaeth yn ddiogel, yn unol â Deddf Diogelu Data 2018.

source: Accessing the service securely
cy: Defnyddio’r gwasanaeth yn ddiogel

source: We recommend that you close the tab on your web browser when you’ve finished using the service. We’ll automatically return you to the service start page if you have not used the service for 60 minutes.
cy: Rydym yn argymell eich bod yn cau’r tab ar eich porwr gwe pan fyddwch wedi gorffen defnyddio’r gwasanaeth. Bydd y ffenestr yn dychwelyd yn awtomatig i dudalen cychwyn y gwasanaeth os na fyddwch wedi defnyddio’r gwasanaeth am 60 munud.

source: Keeping information up to date
cy: Cadw gwybodaeth yn gyfredol

source: <abbr title="lasting powers of attorney"> LPAs </abbr>can change. For example, attorneys may change, people’s names or addresses may change, or the donor may cancel their LPA.
cy: Gall <abbr title="atwrneiaethau arhosol"> LPAs </abbr> newid. Er enghraifft, gall atwrneiod newid, gall enwau neu gyfeiriadau pobl newid, neu gall y rhoddwr ganslo ei LPA.

source: We use OPG’s records about registered <abbr title="lasting powers of attorney">LPAs</abbr> to keep this service up to date. However:
cy: Rydym yn defnyddio cofnodion <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> am <abbr title="atwrneiaethau arhosol">LPAs</abbr> cofrestredig i gadw’r gwasanaeth hwn yn gyfredol. Fodd bynnag:

source: we rely on donors and attorneys to tell us about any changes
cy: rydym yn dibynnu ar roddwyr ac atwrneiod i ddweud wrthym am unrhyw newidiadau

source: once we’re told about a change, it may take several days before we update the <abbr title="lasting power of attorney">LPA</abbr> summary on the service
cy: unwaith y byddwn wedi cael gwybod am newid, gall gymryd sawl diwrnod cyn i ni ddiweddaru crynodeb yr <abbr title="atwrneiaeth arhosol">LPA</abbr> ar y gwasanaeth

source: Tracking use of the service
cy: Olrhain y defnydd o’r gwasanaeth

source: We keep a record of when an access code has been used to view an <abbr title="lasting power of attorney">LPA</abbr>. This information is available to the donor and attorneys.
cy: Rydym yn cadw cofnod o pryd y defnyddiwyd cod mynediad i weld <abbr title="atwrneiaeth arhosol">LPA</abbr>. Mae’r wybodaeth hon ar gael i’r rhoddwr a’r atwrneiod.

source: The information will be stored securely and used in line with our <a class="govuk-link" href="%privacy-link%">privacy notice</a> and <a class="govuk-link" href="%cookies-link%">cookie policy</a>.
cy: Bydd yr wybodaeth yn cael ei storio’n ddiogel a’i defnyddio yn unol â’n <a class="govuk-link" href="%privacy-link%">hysbysiad preifatrwydd</a> a’n <a class="govuk-link" href="%cookies-link%">polisi cwcis</a>.

source: If you suspect fraud or abuse
cy: Os ydych chi’n amau bod rhywun yn​​twyllo neu’n camddefnyddio LPA

source: <a class="govuk-link" href="https://www.gov.uk/report-concern-about-attorney-deputy"> Contact the Office of the Public Guardian</a> if you have concerns about the actions of an attorney. For example, if you’re concerned they’re misusing a donor’s money or are making decisions that are not in the donor’s best interests.
cy: <a class="govuk-link" href="https://www.gov.uk/report-concern-about-attorney-deputy">Cysylltwch â Swyddfa’r Gwarcheidwad Cyhoeddus</a> os oes gennych bryderon am weithredoedd atwrnai. Er enghraifft, os ydych chi’n pryderu bod atwrnai yn camddefnyddio arian rhoddwr neu’n gwneud penderfyniadau nad yw er budd gorau’r rhoddwr.

source: If you suspect abuse, a criminal offence, or think someone is in immediate danger, <a class="govuk-link" href="https://www.gov.uk/contact-police">contact the police</a> first
cy: Os ydych chi’n amau ​​ bod rhywun yn camddefnyddio LPA, neu’n troseddu, neu os ydych yn credu bod rhywun mewn perygl uniongyrchol, <a class="govuk-link" href="https://www.gov.uk/contact-police">cysylltwch â’r heddlu</a> yn gyntaf

source: Data Protection Bill 2018
cy: Bil Diogelu Data 2018

source: Any dispute you have about these terms of use, or your use of OPG services (whether it be contractual or non-contractual), will be subject to the exclusive jurisdiction of the courts of England and Wales.
cy: Fe ymdrinnir ag unrhyw anghydfod sydd gennych ynghylch y telerau defnyddio hyn, neu eich defnydd o wasanaethau <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> (boed dan gontract neu beidio), gan lysoedd Cymru a Lloegr.

source: These terms of use affect your rights and responsibilities under the law. They govern your use of the View a lasting power of attorney service. They do not apply to any other department or online service. Please check these terms of use regularly. We may update them without notice. This might happen if there’s a change in the law or to the way the service works. You’ll agree to any changes if you continue to use the service after the terms of use have been updated
cy: Mae’r telerau defnyddio hyn yn effeithio ar eich hawliau a’ch cyfrifoldebau o dan y gyfraith. Maent yn llywodraethu eich defnydd o’r gwasanaeth gweld atwrneiaeth arhosol. Nid ydynt yn berthnasol i unrhyw adran neu wasanaeth ar-lein arall. Gwiriwch y telerau defnyddio hyn yn rheolaidd. Efallai y byddwn yn eu diweddaru heb rybudd. Gallai hyn ddigwydd os bydd newid yn y gyfraith neu newid i’r ffordd y mae’r gwasanaeth yn gweithio. Byddwch yn cytuno i unrhyw newidiadau os byddwch yn parhau i ddefnyddio’r gwasanaeth ar ôl i’r telerau defnyddio gael eu diweddaru

source: This privacy notice explains why the Office of the Public Guardian (OPG) collects personal data when you use the ‘View a lasting power of attorney’ (LPA) service.
cy: Mae’r hysbysiad preifatrwydd hwn yn esbonio pam bod Swyddfa’r Gwarcheidwad Cyhoeddus (OPG) yn casglu data personol pan fyddwch yn defnyddio’r gwasanaeth ‘Defnyddio atwrneiaeth arhosol’ (LPA).

source: You should read this privacy notice alongside <a class="govuk-link" href="%link%"> <abbr title="Office of the Public Guardian">OPG</abbr>’s personal information charter</a>, which sets out the standards you can expect when we ask for, use or share your personal information.
cy: Dylech ddarllen yr hysbysiad preifatrwydd hwn ochr yn ochr â <a class="govuk-link" href="%link%">siarter wybodaeth bersonol yr <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr></a>, sy’n nodi’r safonau y gallwch eu disgwyl pan ofynnwn am eich gwybodaeth bersonol, pan fyddwn yn ei defnyddio a phan fyddwn yn ei rhannu.

source: Who manages the View a lasting power of attorney service
cy: Pwy sy’n rheoli’r gwasanaeth gweld atwrneiaeth arhosol

source: This service is managed by <abbr title="Office of the Public Guardian">OPG</abbr>, which is an executive agency sponsored by the Ministry of Justice (MOJ).
cy: <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> sy’n rheoli’r gwasanaeth hwn, sef asiantaeth weithredol sy’n cael ei chefnogi gan y Weinyddiaeth Gyfiawnder (MOJ).

source: MOJ is the data controller for the personal data we store. <a class="govuk-link" href="%link%"> <abbr title="Office of the Public Guardian">OPG</abbr>’s personal information charter </a> explains how we process personal data.
cy: <abbr title="Weinyddiaeth Gyfiawnder">MOJ</abbr> yw’r rheolydd data ar gyfer y data personol a gedwir gennym. <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter.cy">Mae siarter gwybodaeth bersonol <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr></a> yn egluro sut rydym yn prosesu data personol.

source: What data we collect and how we use it
cy: Pa ddata rydyn ni’n ei gasglu a sut rydyn ni’n ei ddefnyddio

source: The donor or an attorney on an <abbr title="lasting power of attorney">LPA</abbr> can use the <span style="text-decoration:underline;">Use a lasting power of attorney service</span> to create an ‘access code’ to give to a named organisation and professional. They should create a unique code for each organisation or professional.
cy: Gall y rhoddwr neu’r atwrnai ar <abbr title="atwrneiaeth arhosol">LPA</abbr> ddefnyddio’r gwasanaeth defnyddio atwrneiaeth arhosol i greu ‘cod mynediad’ i’w roi i sefydliad a enwir a gweithiwr proffesiynol. Dylent greu cod unigryw ar gyfer pob sefydliad neu weithiwr proffesiynol.

source: In order to use the View a lasting power of attorney service, you need to enter the unique ‘access code’ given to you by the donor or an attorney on the <abbr title="lasting power of attorney">LPA</abbr> you want to view.
cy: Er mwyn defnyddio’r gwasanaeth Gweld atwrneiaeth arhosol, mae angen i chi roi’r ‘cod mynediad’ unigryw a roddwyd i chi gan y rhoddwr neu’r atwrnai ar yr <abbr title="atwrneiaeth arhosol">LPA</abbr> yr ydych am ei weld.

source: We keep a record of:
cy: Rydym yn cadw cofnod o’r canlynol:
