Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: If these changes affect how your personal data is processed, we’ll take reasonable steps to let you know.
cy: Os yw’r newidiadau hyn yn effeithio ar sut mae eich data personol yn cael ei brosesu, byddwn yn cymryd camau rhesymol i roi gwybod i chi.

source: Any changes to this privacy notice will apply to you and your data immediately.
cy: Bydd unrhyw newidiadau i’r hysbysiad preifatrwydd hwn yn berthnasol i chi a’ch data ar unwaith.

source: Making a complaint
cy: Gwneud cwyn

source: When we ask for personal data, we’ll keep to the law. If you think that your information has not been handled correctly, in addition to contacting the MOJ Data Protection Officer, you can contact the Information Commissioner for independent advice about data protection at the address below:
cy: Pan fyddwn yn gofyn am ddata personol, byddwn yn cadw at y gyfraith. Os credwch fod eich gwybodaeth wedi cael ei thrin yn anghywir, yn ogystal â chysylltu â Swyddog Diogelu Data yr <abbr title="Weinyddiaeth Gyfiawnder">MOJ</abbr>, gallwch gysylltu â’r Comisiynydd Gwybodaeth i gael cyngor annibynnol ar ddiogelu data. Dyma’r cyfeiriad:

source: Phone: 0303 123 1113<br> Textphone: 01625 545860<br> Monday to Friday, 9am to 4:30pm<br>
cy: Ffôn (yn Saesneg): 0303 123 1113<br> Ffôn testun: 01625 545860<br> Dydd Llun i ddydd Gwener, 9am tan 4:30pm.<br>

source: Last updated: 30 March 2020
cy: Diweddarwyd diwethaf: 30 Mawrth 2020

source: Instructions and preferences
cy: Cyfarwyddiadau a dymuniadau

source: If an <abbr title="lasting power of attorney">LPA</abbr> has instructions or preferences we show a scanned image in the LPA summary.
cy: Os oes cyfarwyddiadau neu ddewisiadau <abbr title="atwrneiaethau arhosol">LPA</abbr> , byddwn yn dangos delwedd wedi ei sganio yn y crynodeb o’r Atwrneiaeth Arhosol.

source: This scanned image is also shown to anyone you give an access code to. Please check that the scanned image is readable before giving an access code to organisations. This will work for all access codes made after 4 July 2023.
cy: Dangosir hefyd y ddelwedd hon sydd wedi ei sganio i unrhyw un y rhoddwch gôd mynediad iddo. Gwiriwch fod modd darllen y ddelwedd sydd wedi ei sganio cyn rhoi côd mynediad i sefydliadau. Bydd hwn yn gweithio ar gyfer pob cod mynediad a grëwyd ar ôl 4 Gorffennaf 2023.

source: Organisations may still ask to see the paper LPA if they would like to check anything.
cy: Gallai sefydliadau dal ofyn i gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol os byddent yn dymuno gwirio unrhyw beth.

source: If an <abbr title="lasting power of attorney">LPA</abbr> has instructions or preferences we cannot show these online.
cy: Os oes gan <abbr title="atwrneiaeth arhoso">LPA</abbr> gyfarwyddiadau neu dymuniadau, ni allwn ddangos y rhain ar-lein.

source: Organisations may ask to see the paper <abbr title="lasting power of attorney">LPA</abbr> so that they can find out what the instructions or preferences are.
cy: Gall sefydliadau ofyn am gael gweld yr <abbr title="atwrneiaeth arhosol">LPA</abbr> papur fel y gallant ganfod beth yw’r cyfarwyddiadau’r neu’r dymuniadau.

source: On most LPAs, you’ll find the instructions and preferences in section 7.
cy: Ar y mwyafrif o LPAs, byddwch yn dod o hyd i’r cyfarwyddiadau a’r dymuniadau yn rhan 7.

source: On some LPAs made in or before 2015, instructions and preferences are called 'restrictions and conditions'. You’ll find them on page 9 of the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Ar rhai LPAs a wnaed yn, neu cyn 2015, gelwir cyfarwyddiadau a dymuniadau yn ‘gyfyngiadau ac amodau’. Fe welwch y rhain ar dudalen 9 o’r <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: I do not have the paper LPA
cy: Nid oes gen i’r copi papur o’r LPA

source: When an LPA is registered, we post the LPA to either:
cy: Pan fydd LPA yn cael ei chofrestru, rydym yn postio’r LPA papur un ai at:

source: the donor (the person the <abbr title="lasting power of attorney">LPA</abbr> is for)
cy: y rhoddwr (y sawl y mae’r <abbr title="lasting power of attorney">LPA</abbr> ar ei gyfer)

source: one of the attorneys
cy: un o’r atwrneiod

source: someone else, like a solicitor, who helped to fill in the <abbr title="lasting power of attorney">LPA</abbr> form
cy: rhywun arall, fel cyfreithiwr, a wnaeth gynorthwyo i lenwi’r ffurflen <abbr title="lasting power of attorney">LPA</abbr>

source: Check with these people to see who has the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Gwiriwch â’r bobl hyn i weld pwy sydd â’r <abbr title="atwrneiaeth arhosol">LPA</abbr> papur.

source: If you need more than one copy of the paper <abbr title="lasting power of attorney">LPA</abbr>, the donor or solicitor can make <strong><a href="https://www.gov.uk/power-of-attorney/certify" class="govuk-link">certified copies</a></strong>.
cy: Os oes arnoch angen mwy nac un copi o’r <abbr title="atwrneiaeth arhosol">LPA</abbr> papur, gall y rhoddwr neu gyfreithiwr wneud <strong><a href="https://www.gov.uk/power-of-attorney/certify" class="govuk-link">copïau wedi’u hardystio</a></strong>.

source: You've already asked for an activation key for this LPA
cy: Rydych chi eisoes wedi gofyn am allwedd cadarnhau cyfrif ar gyfer yr LPA yma

source: Once we've finished checking all the details, we'll post you a letter with your activation key for this LPA. We'll contact you if we need any more information.
cy: Ar ôl i ni orffen gwirio’r holl fanylion, byddwn yn anfon llythyr atoch gyda’ch allwedd cadarnhau cyfrif ar gyfer yr atwrneiaeth arhosol hon. Byddwn yn cysylltu â chi os bydd angen rhagor o wybodaeth arnom.

source: The letter will be sent to the address we have for you on our records. We send the key by post because its more secure.
cy: Bydd y llythyr yn cael ei anfon i’r cyfeiriad sydd gennym ar eich cyfer yn ein cofnodion. Rydym yn anfon yr allwedd drwy’r post oherwydd bod hynny’n fwy diogel.

source: You should hear from us or get the activation key letter by %dueDate%. If not, please contact us.
cy: Fe ddylech chi glywed gennym ni neu dylai’r llythyr sy’n cynnwys yr allwedd cadarnhau cyfrif eich cyrraedd erbyn %dueDate%. Os na fydd hynny wedi digwydd, cysylltwch â ni.

source: Continue and ask for a new key
cy: Gofyn am allwedd cadarnhau cyfrif

source: Activate your account
cy: Cadarnhau eich cyfrif

source: Check your email
cy: Gwiriwch eich e-bost

source: We've emailed a link to <strong>%email%</strong>. Click on the link to activate your account. The link will work for the next 24 hours.
cy: Rydym wedi e-bostio dolen i <strong>%email%</strong>. Cliciwch ar y ddolen i gadarnhau eich cyfrif. Mae gennych 24 awr i glicio ar y ddolen.

source: The email should arrive in a few minutes. If it's not in your inbox, check your spam, bulk or junk email inbox. If you have not received the email, we can <a href="%link%" class="govuk-link">resend the activation email</a>.
cy: Dylai’r e-bost gyrraedd ymhen ychydig funudau.Os nad ydyw yn eich mewnflwch, edrychwch yn y ffolder spam neu junk.Os nad ydych wedi cael yr e-bost, gallwn <a href="%link%" class="govuk-link">anfon yr e-bost cadarnhau eto</a>.

source: If you still do not receive the email, please contact us on %number%.
cy: Os nad ydych byth wedi cael yr e-bost, cysylltwch â ni ar %number% (yn Saesneg).

source: If you've already activated your account, you can <a href="%link%" class="govuk-link">sign in</a> now.
cy: Os ydych wedi cadarnhau eich cyfrif yn barod, gallwch <a href="%link%" class="govuk-link">fewngofnodi</a> nawr.

source: Your email address can only be used on one account.
cy: Gellir defnyddio eich cyfeiriad e-bost ar gyfer un cyfrif yn unig.

source: Change your email address
cy: Newid eich cyfeiriad e-bost

source: New email address
cy: Cyfeiriad e-bost newydd

source: Confirm your password
cy: Cadarnhau eich cyfrinair

source: Save new email address
cy: Arbed cyfeiriad e-bost newydd

source: Are you sure you want to remove this LPA?
cy: A ydych yn siŵr eich bod am ddileu’r LPA hon?

source: Are you sure you want to remove %firstname% %surname%'s LPA?
cy: Ydych chi’n siŵr eich bod eisiau dileu LPA %firstname% %surname%?

source: LPA type:
cy: LPA math:

source: If you remove an LPA from your Use a lasting power of attorney account:
cy: Os byddwch yn dileu LPA oddi ar eich cyfrif Defnyddio atwrneiaeth arhosol:

source: all access codes you’ve created for this LPA will be valid until they are cancelled or expire
cy: bydd pob cod mynediad yr ydych wedi ei greu ar gyfer yr LPA hon yn ddilys nes y byddant yn dod i ben neu yn cael eu dileu

source: you’ll not be able to see how the LPA is being used or has been used
cy: ni fyddwch yn gallu gweld sut y mae’r LPA yn cael ei defnyddio na sut y mae wedi cael ei defnyddio

source: you will need to request a new activation key if you want to add the LPA back to your account
cy: bydd rhaid ichi gysylltu â ni i gael allweddair newydd os byddwch am roi’r LPA ar y cyfrif eto

source: Cancel
cy: Canslo

source: Yes, remove LPA
cy: Le, dileu LPA

source: Resetting your password
cy: Ailosod eich cyfrinair

source: Reset your password
cy: Ailosod eich cyfrinair

source: Enter your email address below. If there's an account associated with the address, we'll send you a link to reset your password.
cy: Nodwch eich cyfeiriad e-bost isod. Os oes yna gyfrif ar gyfer y cyfeiriad e-bost hwn, byddwn yn anfon dolen atoch i ailosod eich cyfrinair.

source: Email address
cy: Cyfeiriad e-bost

source: Confirm your email address
cy: Cadarnhewch eich cyfeiriad e-bost

source: Email me the link
cy: Anfon y ddolen ataf drwy e-bost

source: We could not activate that account
cy: Nid oedd modd gwneud y cyfrif yn weithredol

source: We could not activate the account with the link you used. This could be because:
cy: Nid oedd modd inni wneud y cyfrif yn weithredol gyda’r ddolen a ddefnyddiwyd gennych. Gall hyn fod oherwydd:

source: you already have an active account
cy: bod gennych gyfrif gweithredol yn barod

source: <a href="%link%" class="govuk-link">Sign in to your account</a>
cy: <a href="%link%" class="govuk-link">Mewngofnodwch i’ch cyfrif</a>

source: the account activation link has expired
cy: bod y ddolen i wneud y cyfrif yn weithredol wedi dod i ben

source: The link we sent you to activate your account lasts for 24 hours. If you did not use the link in that time, you'll need to <a href="%link%" class="govuk-link">create an account</a>.
cy: Mae’r ddolen wnaethom ni ei hanfon atoch yn para am 24 awr. Os na wnaethoch chi ddefnyddio’r ddolen o fewn y cyfnod hwnnw, bydd rhaid i chi <a href="%link%" class="govuk-link">greu cyfrif</a>.

source: If you need help activating your account, please contact us:
cy: Os oes arnoch angen cymorth i wneud eich cyfrif yn weithredol, cysylltwch â ni:

source: If you're named on more than one <abbr title="lasting power of attorney">LPA</abbr>, you can add all those <abbr title="lasting powers of attorney">LPAs</abbr> to your account
cy: Os ydych wedi’ch enwi ar fwy nac un <abbr title="atwrneiaeth arhosol">LPA</abbr>, gallwch ychwanegu’r holl <abbr title="atwrneiaeth arhosol">LPAs</abbr> hynny at eich cyfrif

source: Your contact details
cy: Eich manylion cyswllt

source: We may need to contact you to ask for more information
cy: Efallai y bydd angen i ni gysylltu â chi i ofyn am ragor o wybodaeth

source: Your telephone number
cy: Eich rhif ffôn

source: or
cy: neu

source: I do not have a phone or cannot use a phone to take calls
cy: Does gen i ddim ffôn neu alla i ddim defnyddio ffôn i dderbyn galwadau

source: We may also contact you by email on
cy: Mae’n bosib y byddwn hefyd yn cysylltu â chi dros yr e-bost ar

source: Your activation key
cy: Eich allwedd cadarnhau cyfrif

source: What is your activation key?
cy: Beth yw eich bysell actifadu?

source: Make sure this is the activation key in the letter we sent you. We will not be able to find the LPA if you enter an activation key we sent to someone else - even if it’s for the same LPA.
cy: Gwnewch yn siŵr mai dyma'r allwedd cadarnhau yn y llythyr a anfonwyd atoch. Ni fyddwn yn gallu dod o hyd i’r atwrneiaeth arhosol os byddwch yn rhoi allwedd cadarnhau a anfonwyd at rywun arall – hyd yn oed os yw ar gyfer yr un atwrneiaeth arhosol.

source: Your activation key:
cy: O ran eich allwedd cadarnhau:

source: can only be used once
cy: dim ond unwaith gellir ei defnyddio

source: expired one year after the date on the letter you can <a href="%link%" class="govuk-link">request a new key</a>
cy: mae eich allwedd yn dod i ben flwyddyn ar ôl y dyddiad ar y llythyr. Os yw eich allwedd wedi dod i ben, gallwch <a href="%link%" class="govuk-link">ofyn am allwedd newydd</a>

source: Activation keys are 13 letters and numbers long and start with a C<br/>For example, C-AB12 CD34 EF56 <br/><br/> You do not need to enter the C-
cy: Mae allweddi cadarnhau cyfrif yn gyfuniad o 13 llythyren a rhifau ac yn dechrau gyda C.<br/>Er enghraifft, C-AB12 CD34 EF56 <br/><br/> Nid oes angen ichi nodi’r C-

source: What is your date of birth?
cy: Beth yw eich dyddiad geni?

source: For example, 31 03 1980
cy: Er enghraifft, 31 03 1980

source: What is the LPA reference number?
cy: Beth yw’r Cyfeirnod LPA?

source: The reference number is in the same letter that has your activation key.
cy: Mae’r cyfeirnod yn yr un llythyr sydd â’ch allwedd cadarnhau.

source: LPA reference numbers are 12 numbers long, for example 7000-0000-0000.<br><br>
cy: Mae cyfeirnodau LPA yn 12 rhif o hyd, er enghraifft, 7000-0000-0000.<br><br>

source: We are changing the way you sign in to Use a lasting power of attorney
cy: Rydym yn newid y ffordd rydych chi’n mewngofnodi i Defnyddio atwrneiaeth arhosol

source: From 13th August 2024 you’ll only be able to sign in to Use a lasting power of attorney using GOV.​UK One Login.
cy: O 13 Awst 2024 ymlaen, dim ond drwy ddefnyddio manylion mewngofnodi GOV.UK One Login y byddwch chi’n gallu mewngofnodi i Defnyddio atwrneiaeth arhosol.

source: You will not be able to access your LPAs any other way.
cy: Ni fyddwch yn gallu cael mynediad at eich atwrneiaeth arhosol mewn unrhyw ffordd arall.

source: What is GOV.​UK One Login?
cy: Beth yw GOV.UK One Login?

source: GOV.​UK One Login is the new way to sign in to central government services, using the same email address and password. It does not work with all government services yet.
cy: GOV.UK One Login yw’r ffordd newydd o fewngofnodi i wasanaethau canolog y llywodraeth, gan ddefnyddio’r un cyfeiriad e-bost a chyfrinair. Nid yw’n gweithio gyda holl wasanaethau’r llywodraeth eto.

source: You can set up your GOV.​UK One Login now or wait until you sign in for the first time on or after 13 August 2024 –
cy: Gallwch sefydlu eich GOV.​UK One Login nawr neu aros nes i chi fewngofnodi am y tro cyntaf ar neu ar ôl 13 Awst 2024 –

source: Use a lasting power of attorney will not appear in GOV.​UK One Login’s list of available services until 13 August 2024.
cy: Ni fydd Defnyddio atwrneiaeth arhosol yn ymddangos ar restr GOV.UK One Login o’r gwasanaethau sydd ar gael, tan 13 Awst 2024.

source: Will there be other changes to the Use a lasting power of attorney service?
cy: A fydd newidiadau eraill i’r gwasanaeth Defnyddio atwrneiaeth arhosol?

source: No - when you start signing in to your account using GOV.​UK One Login, you’ll be able to use the service in the same way as before.
cy: Na - pan fyddwch chi’n dechrau mewngofnodi i’ch cyfrif gan ddefnyddio manylion mewngofnodi GOV.UK One Login, byddwch chi’n gallu defnyddio’r gwasanaeth yn yr un ffordd ag o’r blaen.

source: However, to keep any LPAs you already have in your account, make sure the email address you use for this service is what you’d like to use for GOV.​UK One Login.
cy: Fodd bynnag, i gadw unrhyw atwrneiaeth arhosol sydd gennych chi’n barod yn eich cyfrif, gwnewch yn siŵr mai’r cyfeiriad e-bost rydych chi’n ei ddefnyddio ar gyfer y gwasanaeth hwn yw’r un y byddwch chi am ei ddefnyddio ar gyfer GOV.UK One Login.

source: At the moment, when you sign in to Use a lasting power of attorney, you use
cy: Ar hyn o bryd, pan fyddwch yn mewngofnodi i Defnyddio atwrneiaeth arhosol, rydych yn defnyddio

source: If you want to change your Use a lasting power of attorney email address.
cy: Os ydych chi am newid eich cyfeiriad e-bost ar gyfer Defnyddio atwrneiaeth arhosol.

source: You have until midday of 9 August 2024 to make any changes to your Use a lasting power of attorney email address. You can do this in the
cy: Mae gennych tan 9 Awst ar 12 Gorffennaf 2024 i wneud unrhyw newidiadau i’ch cyfeiriad e-bost ar gyfer Defnyddio atwrneiaeth arhosol. Gallwch wneud hyn yn yr adran

source: ‘Settings’
cy: ‘Gosodiadau’

source: section of your account.
cy: yn eich cyfrif.

source: If you use a different email for GOV.UK One Login, any LPAs added before 13 August 2024 will no longer appear in your account. You’ll need to request new activation keys for each LPA to add them again.
cy: Os ydych chi’n defnyddio cyfeiriad e-bost gwahanol ar gyfer GOV.UK One Login, ni fydd unrhyw atwrneiaeth arhosol a ychwanegwyd cyn 13 Awst 2024 yn ymddangos yn eich cyfrif mwyach. Bydd angen i chi ofyn am allweddi cadarnhau cyfrif newydd ar gyfer pob atwrneiaeth arhosol er mwyn eu hychwanegu eto.

source: Back to 'Your LPAs’
cy: Yn ôl i’ch ‘Atwrniaethau Arhosol

source: We’ve signed you out
cy: Rydym wedi eich allgofnodi

source: We've signed you out
cy: Rydym wedi eich allgofnodi

source: For your security, we've signed you out of this service because you did not use it for 20 minutes.
cy: Rydym wedi eich allgofnodi o’r gwasanaeth am resymau diogelwch, oherwydd ni wnaethoch ei ddefnyddio am 20 munud.

source: Sign in
cy: Mewngofnodi

source: We've already sent you an activation key for this LPA
cy: Rydym eisoes wedi anfon allwedd cadarnhau cyfrif atoch ar gyfer yr LPA yma

source: We posted an activation key to the address we have for you on our records. It should have arrived by %dueDate%.
cy: Rydym wedi anfon allwedd cadarnhau cyfrif i’r cyfeiriad sydd gennym ar eich cyfer yn ein cofnodion. Dylai fod wedi cyrraedd erbyn %dueDate%.

source: If you've lost the letter, you can ask for a new key. This will cancel the key we sent you before.
cy: Os ydych wedi colli’r llythyr, gallwch ofyn am allwedd newydd. Bydd hyn yn canslo’r allwedd a anfonwyd atoch o’r blaen.

source: If the letter did not arrive, <a class="govuk-link" href="%link%">contact us</a> to check we have your correct address before you ask for a new key.
cy: Os na chyrhaeddodd y llythyr, <a class="govuk-link" href="%link%">cysylltwch â ni</a> i wneud yn siŵr bod eich cyfeiriad cywir gennym cyn i chi ofyn am allwedd newydd.

source: Death Notification
cy: Hysbysiad o Farwolaeth

source: Let us know if a donor or attorney dies
cy: Rhowch wybod i ni os bydd rhoddwr neu atwrnai yn marw

source: It's important that we hold up-to-date information about donors and attorneys. This is because an LPA will end when the donor dies, and they can end if an attorney dies.
cy: Mae’n bwysig ein bod yn cadw gwybodaeth gyfredol am roddwyr ac atwrneiod.. Y rheswm am hyn yw y bydd yr LPA yn dod i ben pan fydd y rhoddwr yn marw, a gall ddod i ben os bydd atwrnai’n marw.

source: You should contact us if:
cy: Dylech gysylltu â ni os bydd:

source: the donor dies
cy: rhoddwr yn marw

source: an attorney dies
cy: atwrnai yn marw

source: a replacement attorney dies
cy: atwrnai newydd yn marw

source: We'll update the online LPA summary and our records
cy: Byddwn yn diweddaru’r crynodeb o’r LPA ar-lein a’n cofnodion

source: If the donor dies
cy: Os bydd y rhoddwr yn marw

source: The LPA ends when the donor dies. The donor’s affairs will be looked after by their executors or personal representatives from that point, not their attorneys.
cy: Daw’r LPA i ben pan fydd y rhoddwr yn marw. Bydd ei ysgutorion neu ei gynrychiolwyr personol yn gofalu am ei faterion o’r pwynt hwnnw ymlaen, nid ei atwrneiod.

source: If an attorney or replacement attorney dies
cy: Os bydd atwrnai neu atwrnai newydd yn marw

source: The LPA will end if your attorney dies and there is not a replacement attorney.
cy: Bydd eich LPA yn dod i ben os bydd eich atwrnai’n marw ac os nad oes gennych chi unrhyw atwrneiod newydd.

source: The LPA can continue if:
cy: Caiff eich LPA barhau os:

source: there are other attorneys who can act 'jointly and severally' - but not if they are only allowed to act 'jointly'
cy: oes atwrneiod eraill sy’n gallu gweithredu ‘ar y cyd ac yn unigol’ - ond nid os mai dim ond ‘ar y cyd’ maent yn cael gweithredu

source: there are replacement attorneys
cy: oes atwrneiod i gymryd eu lle

source: How to let us know
cy: Sut i roi gwybod i ni am newid

source: You'll need to send us:
cy: Bydd angen i chi anfon atom:

source: a copy of the death certificate
cy: copi o’i dystysgrif marwolaeth

source: the original LPA
cy: yr LPA wreiddiol

source: all certified copies of the LPA
cy: pob copi ardystiedig o’r LPA

source: a return address where your documents can be sent back to
cy: cyfeiriad dychwelyd ar gyfer anfon eich dogfennau’n ôl atoch

# error
source: As you have not used this service for over 20 minutes, the page has timed out. We've now refreshed the page - please try to sign in again
cy: Gan nad ydych wedi defnyddio’r gwasanaeth hwn ers dros 20 munud, mae’r dudalen wedi cau. Rydym bellach wedi adnewyddu’r dudalen - ceisiwch fewngofnodi eto

# error
source: Enter your new email address
cy: Teipiwch eich cyfeiriad e-bost newydd

# error
source: Enter an email address in the correct format, like name@example.com
cy: Nodwch gyfeiriad e-bost yn y fformat cywir, er enghraifft enw@enghraifft.com

# error
source: The new email address you entered is the same as your current email address. They must be different.
cy: Mae’r cyfeiriad e-bost newydd yr un fath â’ch cyfeiriad e-bost cyfredol. Mae’n rhaid iddynt fod yn wahanol.

# error
source: Enter your password
cy: Teipiwch eich cyfrinair

# error
source: The password you entered is incorrect
cy: Mae’r cyfrinair rydych wedi’i nodi yn anghywir

# error
source: Password must be 12 characters or more
cy: Rhaid i’r cyfrinair fod yn 12 nod neu fwy

# error
source: Passwords do not match
cy: Nid yw’r cyfrineiriau’n cyfateb

# error
source: Confirm your password
cy: Cadarnhewch eich cyfrinair

# error
source: You must accept the terms of use to create an account
cy: Mae’n rhaid i chi dderbyn y telerau defnyddio i greu cyfrif

# error
source: Select yes if you have a Use a lasting power of attorney account
cy: Dewiswch oes os oes gennych gyfrif atwrneiaeth arhosol

# error
source: Security validation failed. Please try again.
cy: Proses dilysu diogelwch wedi methu. Rhowch gynnig arall arni.

# error
source: Check your details and try again. We could not find a Use a lasting power of attorney account with that email address and password.
cy: Gwiriwch eich manylion a rhowch gynnig arall arni. Nid ydym wedi gallu dod o hyd i gyfrif defnyddio Atwrneiaeth Arhosol gyda’r e-bost a’r cyfrinair hwnnw.

# error
source: Enter your activation key
cy: Teipiwch eich allwedd cadarnhau cyfrif

# error
source: Enter an activation key in the correct format
cy: Nodwch allwedd cadarnhau cyfrif yn y fformat cywir

# error
source: The activation key you entered is too long. Check that you only entered the 12 letters and numbers that follow the C-
cy: Mae’r allwedd cadarnhau cyfrif a gofnodwyd gennych yn rhy hir. Gwiriwch mai dim ond y 12 llythyren a rhifau sy’n dilyn C-

# error
source: The activation key you entered is too long
cy: Mae’r allwedd cadarnhau cyfrif rydych wedi’i nodi yn rhy hir

# error
source: The activation key you entered is too short
cy: Mae’r allwedd cadarnhau cyfrif rydych wedi’i nodi yn rhy fyr

# error
source: Enter the LPA reference number
cy: Nodwch y cyfeirnod LPA
