Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: We've got your activation key request
cy: Mae eich cais am allwedd cadarnhau cyfrif wedi ein cyrraedd

source: Once we've checked all the details, we'll post you a letter with your activation key for this LPA. We send it by post because it's more secure.
cy: Ar ôl i ni wirio'r holl fanylion, byddwn yn anfon llythyr atoch gyda'ch allwedd cadarnhau cyfrif ar gyfer yr atwrneiaeth arhosol hon. Byddwn yn ei hanfon drwy'r post oherwydd bod hynny'n fwy diogel.

source: We'll contact you if we need any more information.
cy: Byddwn yn cysylltu â chi os bydd angen rhagor o wybodaeth arnom.

source: Once you've got the activation key, you'll be able to use it to add the LPA to your account.
cy: Ar ôl i chi gael yr allwedd cadarnhau cyfrif, byddwch yn gallu ei defnyddio i ychwanegu'r atwrneiaeth arhosol at eich cyfrif.

source: We've sent you an email to confirm all these details.
cy: Rydym wedi anfon e-bost atoch yn cadarnhau’r holl fanylion hyn.

source: Most people hear from us or get the activation key within 2 weeks of requesting it. However, sometimes it can take a bit longer. If you have not heard from us by %date%, please get in touch.
cy: Bydd y rhan fwyaf o bobl yn clywed gennym neu’n cael allwedd cadarnhau cyfrif o fewn 2 wythnos i wneud cais. Fodd bynnag, weithiau bydd yn cymryd mwy o amser. Os na fyddwch wedi clywed gennym mewn %date%, cysylltwch â ni.

source: Have more than one LPA?
cy: Oes gennych chi fwy nag un LPA?

source: You'll need an activation key for each LPA that you'd like to add to your account.
cy: Bydd angen allwedd cadarnhau cyfrif arnoch ar gyfer pob atwrneiaeth arhosol yr hoffech ei hychwanegu at eich cyfrif.

source: Request another activation key
cy: Cael hyd i’ch allwedd cadarnhau cyfrif

source: Back to your LPAs
cy: Yn ôl i’ch LPAs

source: Your new access code
cy: Ailosod eich cyfrinair

source: Property and finance
cy: Eiddo ac arian

source: Health and welfare
cy: Iechyd a lles

source: Your access code
cy: Eich cod mynediad

source: Copy code
cy: Cod copi

source: Code copied
cy: Cod wedi ei gopïo

source: Give this access code to %organisation%
cy: Rhowch y cod mynediad hwn i %organisation%

source: This code expires in 30 days, on %date%.
cy: Daw’r cod hwn i ben ymhen 30 diwrnod, ar yr %date%.

source: Warning
cy: Rhybudd

source: If there are instructions or preferences on this LPA, you may also be asked to show the paper LPA.
cy: Os oes yna gyfarwyddiadau a dymuniadau ar yr LPA hon, efallai y gofynnir i chi ddangos yr LPA bapur hefyd.

source: As there are instructions and preferences on this LPA, you may also be asked to show the paper LPA.
cy: Gan fod yna gyfarwyddiadau a dymuniadau ar yr LPA hon, efallai y gofynnir i chi ddangos yr LPA bapur hefyd.

source: As there are instructions on this LPA, you may also be asked to show the paper LPA.
cy: Gan fod yna gyfarwyddiadau ar yr LPA hon, efallai y gofynnir i chi ddangos yr LPA bapur hefyd.

source: As there are preferences on this LPA, you may also be asked to show the paper LPA.
cy: Gan fod yna ddymuniadau ar yr LPA hon, efallai y gofynnir i chi ddangos yr LPA bapur hefyd.

source: What to do next
cy: Beth i’w wneud nesaf

source: Give %organisation% this access code. They should go to www.gov.uk/view-lpa to enter the access code and see a summary of the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Rhowch y cod mynediad hwn i %organisation%. Dylent fynd i www.gov.uk/view-lpa i roi’r cod mynediad a gweld crynodeb o’r atwrneiaeth.

source: Scanned copies of the donor’s preferences and instructions will be shown in the LPA summary. You should check the scanned image - if it’s not clear, organisations may ask to see the paper LPA.
cy: Wedi eu sganio o ddewisiadau a gyfarwyddiadau’r rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: Scanned copies of the donor’s preferences will be shown in the LPA summary. You should check the scanned image - if it’s not clear, organisations may ask to see the paper LPA.
cy: Wedi eu sganio o ddewisiadau rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: Scanned copies of the donor’s instructions will be shown in the LPA summary. You should check the scanned image - if it’s not clear, organisations may ask to see the paper LPA.
cy: Wedi eu sganio o gyfarwyddiadau’r rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: Scanned copies of the donor’s preferences or instructions will be shown in the LPA summary. You should check the scanned image - if it’s not clear, organisations may ask to see the paper LPA.
cy: Wedi eu sganio o ddewisiadau neu gyfarwyddiadau’r rhoddwr yn y crynodeb o’r Atwrneiaeth Arhosol. Dylech wirio’r ddelwedd sydd wedi ei sganio - os nad yw hi’n glir, gallai sefydliadau ofyn am gael gweld y fersiwn papur o’r Atwrneiaeth Arhosol.

source: %organisation% may ask you for other information, such as %donorFirstName%'s account details, and your name and contact details. They may also ask you to confirm your identity. This is to protect %donorFirstName% and prevent fraud.
cy: Efallai bydd %organisation% yn gofyn am wybodaeth arall, fel manylion cyfrif %donorFirstName%, eich manylion cyswllt ac ati. Efallai y byddant yn gofyn i chi gadarhau pwy ydych chi. Mae hyn er mwyn diogelu %donorFirstName% ac atal twyll.

source: %organisation% may ask you for other information, such as your customer account details, your attorney's contact details and so on.
cy: Efallai bydd %organisation% yn gofyn am wybodaeth arall, fel manylion eich cyfrif cwsmer, manylion cyswllt eich twrnai ac ati.

source: %organisation% may ask you for other information, such as %donorFirstName%'s NHS number, your contact details and so on.
cy: Efallai bydd %organisation% yn gofyn am wybodaeth arall, fel rhif GIG %donorFirstName%, eich manylion cyswllt ac ati.

source: %organisation% may ask you for other information, such as your NHS number, your attorney's contact details and so on.
cy: Efallai bydd %organisation% yn gofyn am wybodaeth arall, fel eich rhif GIG, manylion cyswllt eich atwrnai ac ati.

source: Give another organisation access
cy: Rhoi mynediad i sefydliad arall

source: Check we've found the right LPA
cy: Cadarnhau ein bod wedi dod o hyd i’r atwrneiaeth arhosol gywir

source: Back
cy: Yn ôl

source: Using the information you gave us, we found these details.
cy: Gan ddefnyddio’r wybodaeth roeddech chi wedi’i rhoi, bu inni dod o hyd i’r manylion hyn.

source: Your name
cy: Eich enw

source: Your role on the LPA
cy: Eich swyddogaeth yn yr LPA hon

source: Donor
cy: Rhoddwr

source: Attorney
cy: Atwrnai

source: The donor's name
cy: Enw’r rhoddwr

source: Type of LPA
cy: Math o LPA

source: Continue
cy: Parhau

source: This is not the correct LPA
cy: Nid dyma’r atwrneiaeth arhosol gywir

source: Access codes for this LPA
cy: Codau mynediad ar gyfer yr LPA hon

source: Check access codes
cy: Gwirio codau mynediad

source: There are no access codes for this LPA.
cy: Nid oes codau mynediad ar gyfer yr LPA hon.

source: When an organisation has been given access you will be able to see the <br> access codes and details here.
cy: Pan fydd sefydliad wedi cael mynediad at LPA, gallwch weld y<br> codau mynediad a’r manylion yma.

source: Give an organisation access
cy: Rhoi mynediad i sefydliad

source: Active codes
cy: Codau i’w defnyddio

source: Give an organisation their access code so they can view this LPA. They should go to www.gov.uk/view-lpa to use the code.
cy: Rhoi cod mynediad i sefydliad i gael gweld yr LPA hon. Dylid mynd i www.gov.uk/gweld-atwrneiaeth-arhosol i ddefnyddio’r cod hwn.

source: Open all
cy: Agor y cyfan

source: Close all
cy: Cau’r cyfan

source: active code details
cy: manylion y codau i’w defnyddio

source: Inactive codes
cy: Codau sydd wedi dod i ben

source: The following codes will no longer work.
cy: Nid yw’r codau canlynol yn gweithio bellach.

source: If an organisation asks to see this <abbr title="lasting power of attorney">LPA</abbr> again, you can <a href="%create-code-link%" class="govuk-link">make them a new code</a>.
cy: Os bydd sefydliad yn gofyn am gael gweld y <abbr title="atwrneiaeth arhosol">LPA</abbr> hon eto, yna gallwch <a href="%create-code-link%" class="govuk-link">greu cod newydd iddynt</a>.

source: inactive code details
cy: manylion y codau sydd wedi dod i ben

source: We've deleted your account
cy: Rydym wedi dileu eich cyfrif

source: To use a lasting power of attorney online in future, you’ll need to create a new account.
cy: I ddefnyddio atwrneiaeth arhosol ar-lein yn y dyfodol, bydd angen i chi greu cyfrif newydd.

source: Back to GOV.UK
cy: Yn ôl i GOV.UK

source: Confirm your new email address
cy: Gadarnhau eich cyfeiriad e-bost newydd

source: Updating your email address
cy: Diweddaru eich cyfeiriad e-bost

source: You’ve asked us to change your email address.
cy: Rydych wedi gofyn i ni newid eich cyfeiriad e-bost.

source: We've emailed a link to <strong class="govuk-!-font-weight-bold">%email%</strong> – please follow the link in the email to confirm the change.
cy: Rydym wedi anfon dolen i <strong class="govuk-!-font-weight-bold">%email%</strong> - cliciwch ar y ddolen yn y neges e-bost i gadarnhau’r newid.

source: The email should arrive in a few minutes, check your spam, bulk and junk folders.
cy: Dylai’r neges e-bost gyrraedd ymhen ychydig funudau, gwiriwch eich ffolderi spam, bulk a junk.

source: The link will work for 48 hours.
cy: Mae gennych 48 awr i glicio ar y ddolen.

source: If you’ve already confirmed the change, you can use your new email address to <a href="%link%" class="govuk-link">sign in</a> now.
cy: Os ydych wedi cadarnhau’r newid yn barod, gallwch nawr ddefnyddio eich cyfeiriad e-bost newydd i <a href="%link%" class="govuk-link">fewngofnodi</a>.

source: You've already added this LPA to your account
cy: Rydym wedi dileu LPA o’ch cyfrif

source: You've already added this <abbr title="lasting power of attorney">LPA</abbr> to your account
cy: Rydych eisoes wedi ychwanegu’r <abbr title="atwrneiaethau arhosol">LPA</abbr> hwn at eich cyfrif

source: Donor name
cy: Enw’r rhoddwr

source: You can <a href="%view-lpa%" class="govuk-link">see this LPA</a> now or <a href="%add-lpa%" class="govuk-link">add another LPA</a> to your account.
cy: Gallwch <a href="%view-lpa%" class="govuk-link">weld yr LPA hwn nawr</a> neu <a href="%add-lpa%" class="govuk-link">ychwanegu LPA arall</a> at eich cyfrif.

source: Create an account
cy: Creu cyfrif

source: If you already have an account on the Use a lasting power of attorney service, please <a href="%link%" class="govuk-link">sign in</a>.
cy: Os oes gennych gyfrif yn barod ar y gwasanaeth Defnyddio atwrneiaeth arhosol, <a href="%link%" class="govuk-link"> mewngofnodwch yma</a>.

source: Enter your email address
cy: Teipiwch eich cyfeiriad e-bost

source: Check that your email address is spelt correctly
cy: Gwiriwch bod eich cyfeiriad e-bost wedi’i sillafu’n gywir

source: Create a password
cy: Crëwch gyfrinair

source: Your password needs to have at least 12 characters
cy: Mae’n rhaid i’ch cyfrinair gynnwys o leiaf 12 o nodau

source: Never share your password with anyone.
cy: Peidiwch â rhoi eich cyfrinair i neb arall.

source: I agree to the <a href="%link%" target="_blank" class="govuk-link" rel="noreferrer noopener">terms of use (opens in new tab)</a>
cy: Rwy’n cytuno i’r <a href="%link%" target="_blank" class="govuk-link" rel="noreferrer noopener">telerau defnyddio (yn agor mewn tab newydd)</a>

source: Create account
cy: Creu cyfrif

source: Change your password
cy: Newid eich cyfrinair

source: Password
cy: Cyfrinair

source: Change password
cy: Newid eich cyfrinair

source: Cannot find LPA
cy: Nid oedd modd cael hyd i LPA

source: We could not find an LPA with that reference number
cy: Dydyn ni ddim wedi dod o hyd i LPA gyda’r cyfeirnod yna

source: LPA reference number:
cy: Cyfeirnod LPA:

source: Check you entered the right LPA reference number
cy: Gwiriwch eich bod wedi rhoi’r cyfeirnod LPA cywir

source: You'll find the reference number on the LPA and at the top of any letter you've received from us about the LPA. If you do not have the LPA or have not kept any letters, check with someone else named on the LPA.
cy: Mae’r cyfeirnod ar yr atwrneiaeth arhosol ac ar frig unrhyw lythyr rydych chi wedi’i gael gennym ni. Os nad yw’r atwrneiaeth arhosol gennych chi neu os nad ydych chi wedi cadw unrhyw lythyrau, holwch rywun arall sydd wedi’i enwi ar yr atwrneiaeth arhosol.

source: If you're sure you entered the right information, please call us:
cy: Os ydych yn sicr eich bod wedi rhoi’r wybodaeth gywir, cysylltwch â ni:

source: We could not find a lasting power of attorney
cy: Dydyn ni ddim yn gallu dod o hyd i atwrneiaeth arhosol (LPA)

source: This could be because:
cy: Gallai’r rheswm fod oherwydd:

source: the LPA reference number you entered is incorrect
cy: mae cyfeirnod yr LPA rydych chi wedi’i roi yn anghywir

source: some of the details you entered about yourself do not match our records
cy: dydy rhai o’r manylion rydych chi wedi’u rhoi ddim yn cyfateb i’n cofnodion

source: Your answers
cy: Eich atebion

source: LPA reference number
cy: Cyfeirnod yr LPA

source: Name
cy: Enw

source: Date of birth
cy: Dyddiad geni

source: Postcode
cy: Cod post

source: Do you live in the UK?
cy: Ydych chi’n byw yn y DU?

source: No
cy: Nac oes

source: If you’re sure you entered the correct information, contact us.
cy: Os ydych chi’n siŵr bod yr wybodaeth rydych chi wedi’i rhoi yn gywir, cysylltwch â ni.

source: Try again
cy: Rhowch gynnig arall arni

source: Terms of use
cy: Telerau defnyddio

source: The Use a lasting power of attorney (LPA) service lets you create ‘access codes’ to give to professionals or organisations so they can view an online summary of an <abbr title="lasting power of attorney">LPA</abbr>. For example, financial institutions, medical professionals, and care organisations.
cy: Mae’r gwasanaeth Defnyddio atwrneiaeth arhosol (LPA) yn eich galluogi i greu ‘codau mynediad’ i’w rhoi i bobl broffesiynol neu sefydliadau fel y gallant weld crynodeb ar-lein o <abbr title="atwrneiaeth arhosol">LPA</abbr>. Er enghraifft, sefydliadau ariannol, gweithwyr proffesiynol meddygol a sefydliadau gofal.

source: The service is for donors and attorneys on an <abbr title="lasting power of attorney">LPA</abbr>.
cy: Mae’r gwasanaeth ar gyfer rhoddwyr ac atwrneiod ar <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: You should be able to use this service instead of showing someone the original paper <abbr title="lasting power of attorney">LPA</abbr>.
cy: Dylech allu defnyddio’r gwasanaeth hwn yn lle gorfod dangos fersiwn papur y <abbr title="atwrneiaeth arhosol">LPA</abbr> i rywun.

source: You cannot use a download or print out of the <abbr title="lasting power of attorney">LPA</abbr> summary in place of the original paper <abbr title="lasting power of attorney">LPA</abbr> or instead of giving someone an access code
cy: Ni allwch ddefnyddio copi wedi’i lawrlwytho neu gopi wedi’i argraffu o’r crynodeb <abbr title="atwrneiaeth arhosol">LPA</abbr> ar-lein yn lle fersiwn papur y <abbr title="latwrneiaeth arhosol">LPA</abbr> neu yn lle rhoi cod mynediad i rywun

source: By using this service you agree to these terms of use and the <a class="govuk-link" href="https://www.gov.uk/help/terms-conditions">GOV.UK terms and conditions</a>.
cy: Trwy ddefnyddio’r gwasanaeth hwn rydych yn cytuno i’r telerau defnyddio hyn a <a class="govuk-link" href="https://www.gov.uk/help/terms-conditions">thelerau ac amodau GOV.UK</a>.

source: Your responsibilities as an attorney
cy: Eich cyfrifoldebau fel atwrnai

source: If you’re an attorney, remember that using this service to give someone access to a summary of the <abbr title="lasting power of attorney">LPA</abbr>, is the same as using the original paper <abbr title="lasting power of attorney">LPA</abbr>.
cy: Os ydych yn atwrnai, cofiwch bod defnyddio’r gwasanaeth hwn i roi mynediad i rywun i grynodeb o’r <abbr title="atwrneiaeth arhosol">LPA</abbr>, yr un fath â defnyddio fersiwn papur y <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: When using an <abbr title="lasting power of attorney">LPA</abbr> you must always follow the legal responsibilities you agreed to when you signed the <abbr title="lasting power of attorney">LPA</abbr>. For example, you must always:
cy: Pan fyddwch yn defnyddio <abbr title="atwrneiaeth arhosol">LPA</abbr> mae’n rhaid i chi wastad ddilyn y cyfrifoldebau cyfreithiol y bu i chi gytuno iddynt wrth lofnodi’r <abbr title="atwrneiaeth arhosol">LPA</abbr>. Er enghraifft, mae’n rhaid i chi wastad:

source: follow the principles of the <a class="govuk-link" href="https://www.gov.uk/government/publications/mental-capacity-act-code-of-practice">Mental Capacity Act</a>
cy: ddilyn egwyddorion y <a class="govuk-link" href="https://www.gov.uk/government/publications/mental-capacity-act-code-of-practice.cy">Ddeddf Galluedd Meddyliol</a>

source: take into account any instructions or preferences the donor set out in their <abbr title="lasting power of attorney">LPA</abbr>
cy: cymryd i ystyriaeth unrhyw gyfarwyddiadau neu ddewisiadau y bu i’r rhoddwr eu nodi yn eu <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: act in the best interests of the donor
cy: gweithredu er lles gorau’r rhoddwr

source: Your account security
cy: Diogelu eich cyfrif

source: When you create an online account for this service, use a valid email address and choose a strong password that someone else will not be able to guess easily.
cy: Pan fyddwch yn creu cyfrif ar-lein ar gyfer y gwasanaeth hwn, defnyddiwch gyfeiriad e-bost dilys a defnyddiwch gyfrinair cadarn na all rhywun arall ddyfalu beth ydyw yn hawdd.

source: It’s your responsibility to keep your sign-in details safe. You should not use a shared email address to create your account. Do not share your password with anyone or write it down.
cy: Eich cyfrifoldeb chi yw cadw eich manylion mewngofnodi yn ddiogel. Ni ddylech ddefnyddio cyfeiriad e-bost rydych yn ei rannu â rhywun arall i greu eich cyfrif. Peidiwch â rhannu eich cyfrinair gyda neb neu ei ysgrifennu ar ddarn o bapur.

source: You’re responsible for all activity on your Use a lasting power of attorney service account. We keep a record of activity for security and anti-fraud purposes.
cy: Chi sy’n gyfrifol am yr holl weithgaredd ar eich cyfrif gwasanaeth Defnyddio atwrneiaeth arhosol. Rydym yn cadw cofnod o’ch gweithgaredd at ddibenion diogelwch ac i atal twyll.

source: We recommend that you sign out of your account when you’re not using the service. We’ll automatically sign you out if you’ve not used the service for 60 minutes.
cy: Rydym yn argymell eich bod yn allgofnodi o’ch cyfrif pan nad ydych yn defnyddio’r gwasanaeth. Byddwn yn eich allgofnodi’n awtomatig os nad ydych wedi defnyddio’r gwasanaeth am 60 munud.

source: If you download or print a copy of the <abbr title="lasting power of attorney">LPA</abbr> summary, make sure you keep the information safe and secure.
cy: Os ydych yn lawrlwytho neu’n argraffu copi o grynodeb ar-lein yr <abbr title="lasting power of attorney">LPA</abbr>, gwnewch yn siŵr eich bod yn cadw’r wybodaeth yn saff ac yn ddiogel.

source: Use access codes responsibly
cy: Defnyddio codau mynediad yn gyfrifol

source: When you give someone an <abbr title="lasting power of attorney">LPA</abbr> access code, you’re giving them access to personal information about the donor and attorneys on an <abbr title="lasting power of attorney">LPA</abbr>.
cy: Pan fyddwch yn rhoi cod mynediad <abbr title="atwrneiaeth arhosol">LPA</abbr> i rywun, rydych yn rhoi mynediad iddynt i wybodaeth bersonol am y rhoddwr a’r atwrneiod ar y <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: Keep access codes secure. Only give access codes to professionals and organisations you trust and who have an appropriate need to view the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Cadwch godau mynediad yn ddiogel. Dylech ond roi cod mynediad i bobl broffesiynol a sefydliadau rydych yn ymddiried ynddynt ac sydd ag angen dilys i weld y <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: We’re not responsible for how personal information, accessed using a code you’ve created, is used, shared, or held.
cy: Nid ydym yn gyfrifol am sut y defnyddir, y rhennir neu y cedwir gwybodaeth bersonol y ceir mynediad ati drwy ddefnyddio cod rydych wedi’i greu.

source: If you lose a code or are worried a code may be used by an unauthorised person, you can cancel the code within the service.
cy: Os byddwch yn colli cod neu’n poeni y gall cod gael ei ddefnyddio gan unigolyn heb awdurdod, gallwch ganslo’r cod yn y gwasanaeth.

source: Access the service securely
cy: Defnyddio’r gwasanaeth yn ddiogel

source: You’re responsible for accessing the service securely. You should not access it using a computer or network that may leave personal information accessible to others or you think may be insecure. For example, you should not:
cy: Rydych chi’n gyfrifol am ddefnyddio’r gwasanaeth yn ddiogel. Ni ddylech ddefnyddio’r gwasanaeth ar gyfrifiadur neu rwydwaith a allai adael gwybodaeth bersonol yn hygyrch i eraill neu a allai fod yn anniogel. Er enghraifft, ni ddylid:

source: leave a computer unprotected while you’re using the service
cy: gadael cyfrifiadur heb ei warchod tra byddwch yn defnyddio’r gwasanaeth

source: access the service using a shared or public computer
cy: defnyddio’r gwasanaeth gyda chyfrifiadur cyhoeddus neu gyfrifiadur sy’n cael ei rannu gyda phobl eraill

source: Keeping your information safe
cy: Cadw eich gwybodaeth yn ddiogel

source: Any information you submit will be stored securely and used inline with our <a class="govuk-link" href="%privacy-notice%">privacy notice</a> and <a class="govuk-link" href="%cookie%">cookie policy</a>.
cy: Bydd unrhyw wybodaeth a roddir gennych yn cael ei storio’n ddiogel a’i defnyddio yn unol â’n <a class="govuk-link" href="%privacy-notice%">hysbysiad preifatrwydd</a> a’n <a class="govuk-link" href="%cookie%">polisi cwcis</a>.

source: Let us know if you want us to change the LPA
cy: Gadewch i ni wybod os ydych eisiau i ni newid yr LPA

source: When professionals and organisations view the <abbr title="lasting power of attorney">LPA</abbr> summary, it’s important they see up to date information.
cy: Pan fydd pobl broffesiynol a sefydliadau yn edrych ar y crynodeb <abbr title="atwrneiaeth arhosol">LPA</abbr>, mae’n bwysig eu bod yn gweld gwybodaeth gyfredol.

source: Let the Office of the Public Guardian (OPG) know if <a class="govuk-link" href="https://www.gov.uk/power-of-attorney/change-your-lasting-power-of-attorney"> changes need to be made to information in an <abbr title="lasting power of attorney">LPA</abbr> </a>. We’ll then update the lasting power of attorney register and make the changes for you to the online summary.
cy: Gadewch i’r Swyddfa Gwarcheidwad Cyhoeddus wybod os oes <a class="govuk-link" href="https://www.gov.uk/atwrneiaeth/newid-eich-atwrneiaeth-arhosol"> angen gwneud newidiadau i wybodaeth mewn LPA. </a>. Mi wnawn wedyn ddiweddaru’r gofrestr atwrneiaeth arhosol a gwneud y newidiadau angenrheidiol i’r crynodeb ar-lein.

source: For example, you should let us know us if:
cy: Er enghraifft, dylech adael i ni wybod:

source: the donor or an attorney changes their name or address
cy: os yw’r rhoddwr neu atwrnai wedi newid ei enw neu ei gyfeiriad
