Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: the donor wants to remove an attorney
cy: os yw’r rhoddwr eisiau tynnu enw atwrnai oddi ar yr LPA

source: an attorney dies or can no longer act
cy: os bu farw atwrnai neu os nad yw’n gallu parhau i weithredu fel atwrnai

source: the donor wants to cancel their <abbr title="lasting power of attorney">LPA</abbr>
cy: os yw’r rhoddwr eisiau canslo eu <abbr title="atwrneiaethau arhosol">LPAs</abbr>

source: Once you’ve let us know about a change, it may be a few days before this shows on the online service.
cy: Unwaith y byddwch wedi gadael i ni wybod am newid, fe all gymryd ychydig o ddyddiau cyn iddo ddangos ar y gwasanaeth ar-lein.

source: Please let us know if changes need to be made as soon as you can.
cy: Gadewch i ni wybod am newidiadau sydd angen eu gwneud cyn gynted â phosibl.

source: <b>Only the Court of Protection can change a registered <abbr title="lasting power of attorney">LPA</abbr></b>. You must not make changes to the paper <abbr title="lasting power of attorney">LPA</abbr> with a pen, correction fluid or in any other way. This applies to all changes, even small things like correcting a spelling mistake in someone’s name. If you change the <abbr title="lasting power of attorney">LPA</abbr>, you may not be able to use it anymore.
cy: Dim ond y Llys Gwarchod all newid <abbr title="atwrneiaeth arhosol">LPA</abbr></b> cofrestredig. Ni ddylech wneud newidiadau i’r <abbr title="atwrneiaeth arhosol">LPA</abbr></b> papur gyda beiro, hylif cywiro neu mewn unrhyw ffordd arall. Mae hyn yn wir am bob newid, hyd yn oed pethau bychan megis cywiro gwall sillafu yn enw unigolyn. Os byddwch yn newid yr <abbr title="atwrneiaeth arhosol">LPA</abbr></b>, mae’n bosib na fyddwch yn gallu ei ddefnyddio mwyach.

source: The online summary
cy: Y crynodeb ar-lein

source: Screenshots, downloads or print outs of the online <abbr title="lasting power of attorney">LPA</abbr> summary are not proof of an <abbr title="lasting power of attorney">LPA</abbr> and may not show the latest status of an <abbr title="lasting power of attorney">LPA</abbr>.
cy: Nid yw cipluniau, copi wedi’i lawrlwytho neu gopi wedi’i argraffu o grynodeb <abbr title="atwrneiaeth arhosol">LPA</abbr>ar-lein yn brawf o <abbr title="atwrneiaeth arhosol">LPA</abbr> ac mae’n bosib na fydd yn dangos statws diweddaraf <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: Governing law
cy: Y gyfraith lywodraethol

source: These terms of use are governed by the laws of England and Wales, including:
cy: Mae’r telerau defnyddio hyn yn cael eu llywodraethu gan gyfreithiau Cymru a Lloegr, gan gynnwys:

source: Computer Misuse Act 1990
cy: Deddf Camddefnyddio Cyfrifiaduron 1990

source: General Data Protection Regulation 2018
cy: Rheoliadau Diogelu Data Cyffredinol 2018

source: Data Protection Act 2018
cy: Bil Diogelu Data 2018

source: Mental Capacity Act 2005
cy: Deddf Galluedd Meddyliol 2005

source: Any dispute you have about these terms of use, or your use of OPG services (whether it be contractual or non-contractual), will be dealt with by the courts of England and Wales.
cy: Fe ymdrinnir ag unrhyw anghydfod sydd gennych ynghylch y telerau defnyddio hyn, neu eich defnydd o wasanaethau <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> (boed dan gontract neu beidio), gan lysoedd Cymru a Lloegr.

source: About these terms of use
cy: Ynghylch y telerau defnyddio hyn

source: Please check these terms of use regularly. We may update them without notice. This might happen if there’s a change in the law or to the way the service works. You’ll agree to any changes if you continue to use the service after the terms of use have been updated.
cy: Gwiriwch y telerau defnyddio hyn yn rheolaidd. Efallai y byddwn yn eu diweddaru heb rybudd. Gall hyn ddigwydd os oes newid yn y gyfraith neu yn sut mae’r gwasanaeth yn gweithio. Byddwch yn cytuno i unrhyw newidiadau os byddwch yn parhau i ddefnyddio’r gwasanaeth ar ôl i’r telerau defnyddio gael eu diweddaru.

source: Current password
cy: Cyfrinair presennol

source: New password
cy: Cyfrinair newydd

source: LPA summary
cy: Crynodeb o’r LPA

source: Back to your <abbr title="lasting power of attorney">LPAs</abbr>
cy: Yn ôl i’ch <abbr title="atwrneiaethau arhosol">LPAs</abbr>

source: <abbr title="lasting power of attorney">LPA</abbr> summary
cy: Gweld crynodeb o’r <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: This <abbr title="lasting power of attorney">LPA</abbr> has been cancelled
cy: Mae’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon wedi ei chanslo

source: This <abbr title="lasting power of attorney">LPA</abbr> is registered and can be used now
cy: Mae’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon wedi ei chofrestru a gallwch nawr ei defnyddio

source: This <abbr title="lasting power of attorney">LPA</abbr> is registered
cy: Mae’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon wedi ei chofrestru

source: While you have mental capacity, your attorneys must get your permission to use this <abbr title="lasting power of attorney">LPA</abbr>.
cy: Tra bod gennych allu meddyliol, rhaid i’ch atwrneiod gael eich caniatâd chi i ddefnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon.

source: While the donor has mental capacity, you must get their permission to use this <abbr title="lasting power of attorney">LPA</abbr>.
cy: Tra bod gan y rhoddwr allu meddyliol, rhaid i chi gael eu caniatâd i ddefnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon.

source: This <abbr title="lasting power of attorney">LPA</abbr> can only be used when the donor has lost capacity.
cy: Dim ond pan fydd y rhoddwr wedi colli gallu y gellir defnyddio’r <abbr title="lasting power of attorney">LPA</abbr> hon.

source: This <abbr title="lasting power of attorney">LPA</abbr> can be used as soon as it's registered unless instructions say otherwise.
cy: Gellir defnyddio’r <abbr title="atwrneiaethau arhosol">LPA</abbr> hon cyn gynted ag y bydd wedi’i chofrestru oni bai bod y cyfarwyddiadau yn dweud fel arall.

source: The attorneys have the authority to make decisions about life-sustaining treatment
cy: Mae gan yr atwrneiod awdurdod i wneud penderfyniadau ynglŷn â thriniaeth cynnal bywyd

source: The attorneys do NOT have the authority to make decisions about life-sustaining treatment
cy: NID oes gan yr atwrneiod yr awdurdod i wneud penderfyniadau ynglŷn â thriniaeth cynnal bywyd

source: Need to change the donor's details?
cy: A oes angen newid manylion y rhoddwr?

source: Need to change an attorney's details?
cy: A oes angen newid manylion atwrnai?

source: <abbr title="lasting power of attorney">LPA</abbr> details
cy: Manylion <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: If any scanned images are not readable, organisations may ask to see the paper LPA so that they can find out what the instructions or preferences are.
cy: Os na allwch ddarllen y ddelweddau a sganiwyd, dywedwch wrth yr unigolyn a roddodd y cod mynediad eich bod eisiau gweld yr LPA bapur.

source: Seen something incorrect in the LPA details?
cy: Ydych chi wedi gweld rhywbeth sy’n anghywir ym manylion yr LPA?

source: Date summary viewed
cy: Dyddiad gweld y crynodeb

source: You cannot use a download or printout of this <abbr title="lasting power of attorney">LPA</abbr> summary. Always use the original paper <abbr title="lasting power of attorney">LPA</abbr> or give someone an access code.
cy: Ni allwch ddefnyddio copi wedi’i lawrlwytho neu gopi wedi’i argraffu o’r crynodeb <abbr title="atwrneiaeth arhosol">LPA</abbr> hwn. Defnyddiwch fersiwn papur y <abbr title="atwrneiaeth arhosol">LPA</abbr> neu rhowch god mynediad i rywun.

source: Privacy notice
cy: Hysbysiad preifatrwydd

source: This privacy notice explains why the Office of the Public Guardian (OPG) collects personal data when you use the ‘Use a lasting power of attorney’ (LPA) service.
cy: Mae’r hysbysiad preifatrwydd hwn yn esbonio pam bod <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> yn casglu data personol pan fyddwch yn defnyddio’r gwasanaeth ‘Defnyddio atwrneiaeth arhosol’ (LPA).

source: This privacy notice also explains:
cy: Mae’r hysbysiad preifatrwydd hwn hefyd yn egluro:

source: how we store your data
cy: sut rydym yn storio eich data

source: what we do with your data
cy: beth rydym yn ei wneud gyda’ch data

source: how you can get a copy of the data we have about you
cy: sut y gallwch gael copi o’r data sydd gennym amdanoch

source: how you can complain if you think we’ve done something wrong
cy: sut y gallwch wneud cwyn os ydych yn credu ein bod wedi gwneud rhywbeth o’i le

source: You should read this privacy notice alongside:
cy: Dylech ddarllen yr hysbysiad preifatrwydd hwn ochr yn ochr â:

source: <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter"> OPG’s personal information charter </a>, which sets out the standards you can expect when we ask for, use or share your personal information
cy: <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter.cy"> siarter wybodaeth bersonol <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> </a>, sy’n nodi’r safonau y gallwch eu disgwyl pan fyddwn yn gofyn am eich gwybodaeth bersonol, ei defnyddio neu ei rhannu

source: <a class="govuk-link" href="https://www.gov.uk/government/publications/opg-privacy-notice-lasting-and-enduring-powers-of-attorney"> OPG’s lasting power of attorney privacy notice </a>, which explains how we use and protect your data when you’re named on an <abbr title="lasting power of attorney">LPA</abbr>
cy: <a class="govuk-link" href="https://www.gov.uk/government/publications/opg-privacy-notice-lasting-and-enduring-powers-of-attorney.cy"> hysbysiad preifatrwydd atwrneiaeth arhosol <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> </a>, sy’n egluro sut rydym yn defnyddio ac yn diogelu eich data pan fyddwch wedi’ch enwi ar LPA

source: Who manages the Use a lasting power of attorney service
cy: Pwy sy’n rheoli’r gwasanaeth Defnyddio atwrneiaeth arhosol

source: This service is managed by OPG, which is an executive agency sponsored by the Ministry of Justice (MOJ).
cy: <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> sy’n rheoli’r gwasanaeth hwn, sef asiantaeth weithredol sy’n cael ei chefnogi gan y Weinyddiaeth Gyfiawnder (MOJ).

source: MOJ is the data controller for the personal data we store. <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter"> OPG’s personal information charter </a> explains how we process personal data.
cy: <abbr title="Weinyddiaeth Gyfiawnder">MOJ</abbr> yw’r rheolydd data ar gyfer y data personol a gedwir gennym. <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter.cy"> Mae siarter gwybodaeth bersonol <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> </a> yn egluro sut rydym yn prosesu data personol.

source: You can find more information about using the Use a lasting power of attorney service in our <a class="govuk-link" href="%terms-of-use%">terms of use</a> and <a class="govuk-link" href="%cookie%">cookie policy.
cy: Mae rhagor o wybodaeth am y gwasanaeth Gweld atwrneiaeth arhosol yn ein <a class="govuk-link" href="%terms-of-use%">telerau defnyddio a’r <a class="govuk-link" href="%cookie%">polisi cwcis.

source: Why we collect personal data and how we use it
cy: Pa ddata rydym ni’n ei gasglu a sut rydym yn ei ddefnyddio

source: We only collect the personal data that is relevant for the services we are providing to you.
cy: Rydym ond yn casglu’r data personol sy’n berthnasol i’r gwasanaethau rydym yn eu darparu ar eich cyfer.

source: In order to use this service, you need to enter some personal data and create an account
cy: Er mwyn gallu defnyddio’r gwasanaeth hwn, bydd angen i chi roi data personol i ni a chreu cyfrif

source: The personal data we collect includes:
cy: Mae’r data personol rydym yn ei gasglu yn cynnwys:

source: your email address
cy: eich cyfeiriad e-bost

source: your name and date of birth
cy: eich enw a’ch dyddiad geni

source: your computer’s IP address while you use this service
cy: cyfeiriad IP eich cyfrifiadur tra byddwch yn defnyddio’r gwasanaeth hwn

source: We use the data to find the <abbr title="Lasting power of attorney">LPA</abbr> you’re named on and to create your account.
cy: Rydym yn defnyddio’r data i ddod o hyd i’r <abbr title="atwrneiaeth arhosol">LPA</abbr> rydych wedi’ch henwi arni ac i greu eich cyfrif.

source: The service also keeps a record of the <abbr title="lasting power of attorney">LPA</abbr> access codes you’ve made and which organisations you made them for.
cy: Mae’r gwasanaeth hefyd yn cadw cofnod o’r codau mynediad <abbr title="atwrneiaethau arhosol">LPA</abbr> rydych wedi’u creu a’r sefydliadau rydych wedi rhoi cod iddynt.

source: If other people named on the <abbr title="lasting power of attorney">LPA</abbr> (the donor or attorneys) are also using the service, they can see which organisations you’ve made access codes for.
cy: Os bydd pobl eraill sydd wedi’u henwi ar y <abbr title="atwrneiaeth arhosol">LPA</abbr> (y rhoddwr neu atwrneiod) hefyd yn defnyddio’r gwasanaeth, gallant weld pa sefydliadau rydych wedi creu codau mynediad ar eu cyfer.

source: Cookies and site usage data
cy: Cwcis a data am y defnydd a wneir o’r gwasanaeth

source: We collect site usage information from this service. This allows us to see how the service is being used so we can improve it. This information does not contain any personal data and is stored separately from the information you enter when using this service.
cy: Rydym yn casglu gwybodaeth am y defnydd a wneir o’r gwasanaeth hwn. Mae hyn yn ein galluogi i weld sut y defnyddir y gwasanaeth fel y gallwn ei wella Nid yw’r wybodaeth hon yn cynnwys unrhyw ddata personol ac fe’i cedwir ar wahân i’r wybodaeth y byddwch yn ei rhoi wrth ddefnyddio’r gwasanaeth hwn.

source: Find out more about <a class="govuk-link" href="https://www.gov.uk/help/cookies">cookies</a>.
cy: Darganfod mwy am <a class="govuk-link" href="https://www.gov.uk/help/cookies">gwcis</a>.

source: Legal basis for processing this data
cy: Y sail gyfreithiol dros brosesu’r data hwn

source: Your use of this online service is optional. If you prefer, you can show the original paper <abbr title="lasting power of attorney">LPA</abbr>, or a certified copy, to people who need to see it.
cy: Nid oes rhaid i chi ddefnyddio’r gwasanaeth ar-lein hwn. Os byddai’n well gennych, gallwch ddangos fersiwn papur gwreiddiol y <abbr title="atwrneiaeth arhosol">LPA</abbr>, neu gopi ardystiedig, i bobl sydd angen ei weld.

source: We operate the Use a lasting power of attorney service as part of our legal responsibilities under the Mental Capacity Act 2005.
cy: Rydym yn cynnig y gwasanaeth Defnyddio atwrneiaeth arhosol fel rhan o’n cyfrifoldebau cyfreithiol dan Ddeddf Galluedd Meddyliol 2005.

source: Personal data and the online summary
cy: Data personol a’r crynodeb ar-lein

source: The donor or an attorney named on an <abbr title="lasting power of attorney">LPA</abbr> can use this service to give a third party access to an online summary of the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Gall rhoddwr neu atwrnai sydd wedi’i enwi ar <abbr title="atwrneiaeth arhosol">LPA</abbr> ddefnyddio’r gwasanaeth hwn i roi mynediad i drydydd parti at grynodeb ar-lein o’r <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: This summary includes:
cy: Mae’r crynodeb hwn yn cynnwys:

source: the name and address of the donor and any active attorneys
cy: enw a chyfeiriad y rhoddwr ac unrhyw atwrneiod gweithredol

source: the name of any inactive attorneys
cy: enw unrhyw atwrnai anweithredol

source: whether the <abbr title="lasting power of attorney">LPA</abbr> is currently valid
cy: a yw’r <abbr title="atwrneiaethau arhosol">LPA</abbr> yn weithredol ar hyn o bryd

source: when the <abbr title="lasting power of attorney">LPA</abbr> can be used (property and finance <abbr title="lasting powers of attorney">LPAs</abbr> only)
cy: pryd y gellir defnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> (<abbr title="atwrneiaeth arhosol">LPA</abbr> ar gyfer eiddo a materion ariannol yn unig)

source: whether the donor chose to allow their attorneys to make decisions on life-sustaining treatment (health and welfare <abbr title="lasting powers of attorney">LPAs</abbr> only)
cy: a roddodd y rhoddwr ganiatâd i’w atwrneiod wneud penderfyniadau ar driniaeth cynnal bywyd (<abbr title="atwrneiaeth arhosol">LPAs</abbr> ar gyfer iechyd a lles yn unig)

source: Third parties can download and keep a copy of the summary.
cy: Gall trydydd parti lawrlwytho a chadw copi o’r crynodeb.

source: We’re not responsible for how personal data, accessed by a third party using a code created by a donor or attorney, is used, shared, or held.
cy: Nid ydym yn gyfrifol am sut y defnyddir, y rhennir neu y cedwir data personol y ceir mynediad ato gan drydydd parti drwy ddefnyddio cod a grëwyd gan roddwr neu atwrnai.

source: How we store data
cy: Sut yr ydym yn storio data

source: Information you enter into the service is stored in a secure database within the European Economic Area (EEA). However, due to the global nature of the internet, the data sent to and from the database may transit through countries outside of the EEA. Data is not stored in a non-EEA country.
cy: Bydd gwybodaeth y byddwch yn ei rhoi wrth ddefnyddio’r gwasanaeth yn cael ei storio mewn cronfa ddata ddiogel o fewn yr Ardal Economaidd Ewropeaidd (AEE). Fodd bynnag, oherwydd natur fyd-eang y rhyngrwyd, gall y data a anfonir i’r gronfa ddata ac ohoni deithio drwy wledydd y tu allan i’r AEE. Ni chedwir data mewn gwlad y tu allan i’r AEE.

source: It may sometimes be necessary to transfer personal information overseas. Any transfers will fully comply with all aspects of data protection law.
cy: Weithiau, efallai y bydd angen trosglwyddo gwybodaeth bersonol dramor. Bydd unrhyw drosglwyddiadau a wneir yn cydymffurfio’n llwyr â phob agwedd o’r gyfraith diogelu data.

source: Who has access to data in the service
cy: Pwy sydd â mynediad i ddata yn y gwasanaeth hwn

source: MOJ staff are responsible for supporting the service and have access to the secure database.
cy: Staff <abbr title="Weinyddiaeth Gyfiawnder">MOJ</abbr> sy’n gyfrifol am gefnogi’r gwasanaeth ac mae ganddynt fynediad at y gronfa ddata ddiogel.

source: All OPG staff who have access to the database have MOJ security clearance.
cy: Mae gan holl staff <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr> sydd â mynediad at y gronfa ddata gliriad diogelwch <abbr title="Weinyddiaeth Gyfiawnder">MOJ</abbr>.

source: Our hosting provider (Amazon Web Services) is not allowed to routinely access the secure data. If they need to do so for operational purposes, their access is strictly controlled and approved by OPG.
cy: Fel rheol, ni chaniateir i’n darparwr (Amazon Web Services) gael mynediad i’r data diogel. Os oes angen mynediad arnynt am resymau gweithredol, rheolir a chymeradwyir eu mynediad yn gadarn gan <abbr title="Swyddfa’r Gwarcheidwad Cyhoeddus">OPG</abbr>.

source: You can find out more about how we store and use this data in our <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter"> personal information charter </a>.
cy: Mae rhagor o wybodaeth am sut rydym yn cadw ac yn defnyddio’r data hwn yn ein <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter.cy"> siarter gwybodaeth bersonol </a>.

source: We do not use personal data when testing the service.
cy: Nid ydym yn defnyddio data personol pan fyddwn yn profi’r gwasanaeth.

source: How long we keep data
cy: Pa mor hir y byddwn yn cadw data

source: We’ll keep your personal data in line with our <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter"> retention policy </a>.
cy: Byddwn yn cadw eich data personol yn unol â’n <a class="govuk-link" href="https://www.gov.uk/government/organisations/office-of-the-public-guardian/about/personal-information-charter.cy"> polisi cadw </a>.

source: Contact us if you want to change your personal data.
cy: Cysylltwch â ni os ydych eisiau newid eich data personol.

source: How to get a copy of your information
cy: Sut i gael copi o’ch gwybodaeth

source: You can find out what personal data we hold about you in the service by making a subject access request.
cy: Gallwch ganfod pa ddata personol rydym yn ei gadw amdanoch yn y gwasanaeth drwy wneud ‘cais gwrthrych am wybodaeth’.

source: Find out more about subject access requests
cy: Darganfyddwch mwy am geisiadau gwrthrych am wybodaeth

source: Sharing personal data
cy: Rhannu data personol

source: We’ll only share the information you give us when the law says we can.
cy: Byddwn ond yn rhannu’r wybodaeth a roddwch i ni pan fydd y gyfraith yn datgan y cawn wneud hynny.

source: For example, we may share information with the police to help them prevent or investigate crime.
cy: Er enghraifft, efallai y byddwn yn rhannu gwybodaeth gyda’r heddlu i’w helpu i atal neu ymchwilio i drosedd.

source: We’ll never:
cy: Ni fyddwn byth yn:

source: share your information with other organisations for marketing, market research or commercial purposes
cy: rhannu eich gwybodaeth gyda sefydliadau eraill at bwrpas marchnata, cynnal ymchwil i’r farchnad neu bwrpas masnachol

source: sell or rent your data to third parties
cy: gwerthu neu rentu eich data i drydydd parti

source: Getting more information
cy: Cael rhagor o wybodaeth

source: You can get more details on:
cy: Gellir cael mwy o fanylion am:

source: agreements we have with other organisations for sharing information
cy: gytundebau sydd gennym â sefydliadau eraill ar gyfer rhannu gwybodaeth

source: when we can pass on personal information without telling you, for example, to help with the prevention or detection of crime or to produce anonymised statistics
cy: pryd y gallwn drosglwyddo gwybodaeth bersonol heb ddweud wrthych, er enghraifft, i helpu i atal neu ganfod trosedd neu i gynhyrchu ystadegau anhysbys

source: instructions we give to staff on how to collect, use or delete your personal data
cy: cyfarwyddiadau a roir i staff ar sut i gasglu, defnyddio neu ddileu eich data personol

source: how we check that the information we hold is accurate and up-to-date
cy: sut rydym yn gwirio bod yr wybodaeth sydd gennym yn gywir ac yn gyfredol

source: how to make a complaint
cy: sut i wneud cwyn

source: anything in this privacy notice
cy: unrhyw beth sydd yn yr hysbysiad preifatrwydd hwn

source: what to do if you think that your personal data has been misused or mishandled
cy: beth i’w wneud os ydych yn credu bod eich data personol wedi’i gamddefnyddio neu ei gam-drafod

source: For more information, please contact:
cy: Am ragor o wybodaeth, cysylltwch â:

source: Changes to this notice
cy: Newidiadau i’r hysbysiad hwn

source: We may change this privacy notice from time to time. When we do, we’ll update the ‘last updated’ date at the bottom of this page.
cy: Efallai y byddwn yn newid yr hysbysiad preifatrwydd hwn o bryd i’w gilydd. Pan fyddwn yn gwneud hynny, byddwn yn diweddaru’r dyddiad ‘diweddarwyd ddiwethaf’ ar waelod y dudalen hon.
