Repository: ministryofjustice/opg-use-an-lpa
Catalog: service-front/app/languages/*/LC_MESSAGES/messages.po
Languages: cy

source: Let us know if a donor or attorney's details change
cy: Rhowch wybod inni os bydd manylion rhoddwr neu atwrnai yn newid

source: It's important that we hold up-to-date information about donors and attorneys. This is because the first time you show an <abbr title="lasting power of attorney">LPA</abbr> to an organisation, they might ask you to confirm that your name and address match what’s on the <abbr title="lasting power of attorney">LPA</abbr>.
cy: Mae’n bwysig bod gennym yr wybodaeth ddiweddaraf am roddwyr ac atwrneiod. Mae hyn oherwydd y tro cyntaf y byddwch yn dangos <abbr title="atwrneiaeth arhosol">LPA</abbr> i sefydliad, efallai y byddant yn gofyn i chi gadarnhau bod eich enw a’ch cyfeiriad yn cyfateb i’r hyn sydd ar y <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: the donor or an attorney has moved house
cy: os yw’r rhoddwr neu atwrnai wedi symud tŷ

source: the donor or an attorney has changed their name
cy: os yw’r rhoddwr neu atwrnai wedi newid ei enw

source: the donor's or an attorney's name or address is misspelt
cy: os yw enw neu gyfeiriad y rhoddwr neu atwrnai wedi ei gamsillafu

source: an attorneys date of birth is wrong
cy: mae dyddiad geni atwrnai yn anghywir

source: the donor or an attorney dies
cy: rhoddwr neu atwrnai yn marw

source: If you’re the donor, you can tell us about changes to your details and your attorney’s details.
cy: Os mai chi yw’r rhoddwr, gallwch ddweud wrthym am unrhyw newid i’ch manylion chi a manylion atwrnai.

source: If you’re an attorney, you can tell us about changes to the donor’s details and your details. You cannot update another attorney’s details.
cy: Os ydych yn atwrnai, gallwch ddweud wrthym am unrhyw newid i fanylion y rhoddwr a’ch manylion chi. Ni allwch ddiweddaru manylion atwrnai arall.

source: It's important that we hold up-to-date information about donors and attorneys. This is because an LPA will end when the donor dies, and can end if an attorney dies.
cy: Mae’n bwysig ein bod yn cadw gwybodaeth gyfredol am roddwyr ac atwrneiod. Y rheswm am hyn yw y bydd yr LPA yn dod i ben pan fydd y rhoddwr yn marw, a gall ddod i ben os bydd atwrnai’n marw.

source: Find out more about what to do if <a class="govuk-link" href="%link%"> the donor or an attorney dies</a>
cy: Rhagor o wybodaeth am beth i’w wneud <a class="govuk-link" href="%link%">os bydd y rhoddwr neu’r atwrnai yn marw</a>

source: Cancel LPA access code
cy: Canclo cod mynediad LPA

source: Are you sure you want to cancel this code?
cy: Ydych chi’n siŵr eich bod eisiau canslo’r cod hwn?

source: You're about to cancel the access code for
cy: Rydych ar fin canslo cod mynediad

source: Doing this will stop the organisation from accessing the <abbr title="lasting power of attorney">LPA</abbr> summary. You can give access again by creating a new code.
cy: Bydd gwneud hyn yn atal y sefydliad rhag gallu cael mynediad at y crynodeb o’r <abbr title="atwrneiaeth arhosol">LPA</abbr> . Gallwch roi mynediad i’r sefydliad eto yn y dyfodol drwy greu cod newydd.

source: No, return to access codes
cy: Nac ydw, hoffwn ddychwelyd i codau mynediad LPA

source: Yes, cancel code
cy: Ydw, hoffwn ganslo’r cod

source: We've emailed a link to <strong class="govuk-!-font-weight-bold">%email%</strong> so that you can reset your password for your Use a lasting power of attorney account.
cy: Rydym wedi e-bostio dolen i <strong class="govuk-!-font-weight-bold">%email%</strong> er mwyn i chi allu ailosod eich cyfrinair ar gyfer eich cyfrif Defnyddio atwrneiaeth arhosol.

source: If you have not received an email within a few minutes, please check your spam, bulk or junk email folder &mdash; your email system may have blocked it by mistake. If there’s no account with this email address we’ll also let you know.
cy: Os na fyddwch wedi derbyn e-bost o fewn ychydig funudau, edrychwch yn eich ffolder sbam, swmp neu sothach &mdash; efallai bod eich system e-bost wedi ei rwystro ar gam. Os nad oes cyfrif gyda’r cyfeiriad e-bost hwn, byddwn yn rhoi gwybod i chi am hynny hefyd.

source: Settings
cy: Gosodiadau

source: Your sign-in details
cy: Eich manylion mewngofnodi

source: You use GOV.UK One Login to sign in to the Use a lasting power of attorney service.
cy: Rydych chi’n defnyddio GOV.UK One Login i fewngofnodi i’r gwasanaeth Defnyddio atwrneiaeth arhosol.

source: You can change these details in your GOV.UK One Login:
cy: Gallwch newid y manylion hyn yn eich GOV.UK One Login:

source: e-mail address
cy: cyfeiriad e-bost

source: password
cy: cyfrinair

source: how you get security codes to sign in
cy: sut i gael codau diogelwch i fewngofnodi

source: Change your sign-in details in your GOV.UK One Login
cy: Newid eich manylion mewngofnodi yn eich GOV.UK One Login

source: Delete your Use a lasting power of attorney account
cy: Dileu eich cyfrif Defnyddio atwrneiaeth arhosol

source: If you no longer use your Use a lasting power of attorney account, you can delete it.
cy: Os nad oes arnoch angen eich cyfrif Defnyddio atwrneiaeth arhosol mwyach, gallwch ei ddileu.

source: Find out more about deleting your account
cy: Rhagor o wybodaeth am ddileu eich cyfrif

source: Change<span class="govuk-visually-hidden"> email address</span>
cy: Newid<span class="govuk-visually-hidden">fy nghyfeiriad e-bost</span>

source: Change<span class="govuk-visually-hidden"> password</span>
cy: Newid<span class="govuk-visually-hidden"> fy nghyfrinair</span>

source: Need to update the online <abbr title="lasting power of attorney">LPA</abbr> summary?
cy: Ydych chi angen diweddaru’r crynodeb <abbr title="atwrneiaeth arhosol">LPA</abbr> ar-lein?

source: Change a donor or attorney's details
cy: Newid manylion rhoddwr neu atwrnai

source: Delete account
cy: Dileu cyfrif

source: Any lasting power of attorney (LPA) you add to your account will show on this page.
cy: Bydd unrhyw atwrneiaeth arhosol (LPA) y byddwch yn ei hychwanegu at eich cyfrif yn ymddangos ar y dudalen hon.

source: Find out about <a href="https://www.gov.uk/lasting-power-attorney-duties" class="govuk-link">the role of an attorney</a> and how to support the donor <a href="https://www.gov.uk/make-decisions-for-someone/making-decisions" class="govuk-link">to make decisions</a>.
cy: Darganfyddwch am <a href=%link1_cy% class="govuk-link">rôl atwrnai</a> a sut maent yn cefnogi rhoddwyr <a href=%link2_cy% class="govuk-link">wneud penderfyniadau</a>.

source: view an <abbr title="lasting power of attorney">LPA</abbr> summary
cy: gweld crynodeb o <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: Add your first LPA
cy: Ychwanegu eich LPA cyntaf

source: Cookies
cy: Cwcis

source: Cookies are small files saved on your phone, tablet or computer when you visit a website.
cy: Ffeiliau a arbedir ar eich ffôn, eich tabled neu eich cyfrifiadur pan fyddwch yn ymweld â gwefan yw cwcis.

source: We use cookies to make the Use a lasting power of attorney service work and collect information about how you use our service.
cy: Rydym yn defnyddio cwcis i storio gwybodaeth am sut yr ydych yn defnyddio’r gwasanaeth Defnyddio atwrneiaeth arhosol, er enghraifft y tudalennau y byddwch yn ymweld â hwy.

source: We use cookies to make the View a lasting power of attorney service work and collect information about how you use our service.
cy: Rydym yn defnyddio cwcis i storio gwybodaeth am sut yr ydych yn defnyddio’r gwasanaeth Gweld atwrneiaeth arhosol, er enghraifft y tudalennau y byddwch yn ymweld â hwy.

source: Essential cookies
cy: Cwcis hanfodol

source: Essential cookies keep your information secure while you use this service. We do not need to ask permission to use them.
cy: Mae cwcis hanfodol yn cadw eich gwybodaeth yn ddiogel wrth i chi ddefnyddio’r gwasanaeth hwn. Nid oes angen i ni ofyn am ganiatâd i’w defnyddio.

source: Purpose
cy: Pwrpas

source: Expires after
cy: Yn dod i ben ar ôl

source: Saves your cookie consent settings
cy: Mae’n cadw eich gosodiadau caniatâd cwcis

source: 1 year
cy: 1 flwyddyn

source: Used to remember your progress through the service
cy: Fe’i defnyddir i gofio eich cynnydd drwy’r gwasanaeth

source: 24 hours
cy: 24 awr

source: Analytics cookies (optional)
cy: Cwcis dadansoddeg (dewisol)

source: With your permission, we use Google Analytics to collect data about how you use the Use a lasting power of attorney service. This information helps us to improve our service.
cy: Gyda’ch caniatâd chi, rydym yn defnyddio Google Analytics i gasglu data am sut rydych chi’n defnyddio’r gwasanaeth Defnyddio atwrneiaeth arhosol. Mae’r wybodaeth hon yn ein helpu ni i wella ein gwasanaeth.

source: With your permission, we use Google Analytics to collect data about how you use the View a lasting power of attorney service. This information helps us to improve our service.
cy: Gyda’ch caniatâd chi, rydym yn defnyddio Google Analytics i gasglu data am sut rydych chi’n defnyddio’r gwasanaeth Gweld atwrneiaeth arhosol. Mae’r wybodaeth hon yn ein helpu ni i wella ein gwasanaeth.

source: Google is not allowed to use or share our analytics data with anyone.
cy: Nid yw Google yn cael defnyddio na rhannu ein data dadansoddeg ag unrhyw un.

source: No personal details are stored with this information, so you can’t be identified.
cy: Ni chedwir manylion personol gyda’r wybodaeth hon, felly ni ellir eich adnabod.

source: Google Analytics stores anonymised information about:
cy: Mae Google Analytics yn storio gwybodaeth ddienw am y canlynol:

source: how you got to the Use a lasting power of attorney service
cy: sut cyrhaeddoch chi’r Gwasanaeth defnyddio atwrneiaeth arhosol

source: how you got to the View a lasting power of attorney service
cy: sut cyrhaeddoch chi’r Gwasanaeth defnyddio atwrneiaeth arhosol

source: the pages you visit on the service and how long you spend on them
cy: y tudalennau y byddwch chi’n ymweld â nhw ar y gwasanaeth a faint o amser y byddwch chi’n ei dreulio arnynt

source: any errors you see while using the service
cy: unrhyw wall a welwch wrth ddefnyddio’r gwasanaeth

source: Checks if you’ve visited the service before. This helps us count how many people visit the service.
cy: Mae’n gwirio a ydych chi wedi ymweld â’r gwasanaeth o’r blaen. Mae hyn yn ein helpu i gyfrif faint o bobl sy’n ymweld â’r gwasanaeth.

source: 2 years
cy: 2 flynedd

source: Tells us how you got to the service and how you use it. This helps us understand how well the service is working.
cy: Mae’n dweud wrthym sut gwnaethoch chi gyrraedd y gwasanaeth a sut rydych chi’n ei ddefnyddio. Mae hyn yn ein helpu ni i ddeall pa mor dda mae’r gwasanaeth yn gweithio.

source: Do you want to accept analytics cookies?
cy: Ydych chi eisiau derbyn cwcis dadansoddeg?

source: Yes
cy: Oes

source: Save changes
cy: Arbed newidiadau

source: Preferences and instructions cannot be shown for this LPA
cy: Does dim modd dangos dymuniadau na chyfarwyddiadau ar gyfer yr LPA yma

source: Unfortunately, some information on instructions and preferences is missing from this service. This affects LPAs the donor signed before 2016.
cy: Yn anffodus, mae rhywfaint o’r wybodaeth am ddymuniadau a chyfarwyddiadau ar goll o’r gwasanaeth hwn. Mae hyn yn effeithio ar atwrneiaethau arhosol a gofrestrwyd cyn 2016.

source: We are working to fix this problem.
cy: Rydym yn gweithio ar ddatrys y broblem hon.

source: In the meantime, organisations may ask to see the paper LPA so that they can check if there are instructions or preferences.
cy: Yn y cyfamser, gall sefydliadau ofyn am gael gweld yr atwrneiaeth arhosol bapur er mwyn iddynt allu gweld a oes cyfarwyddiadau neu ddymuniadau ynddi.

source: Contact us
cy: Cysylltwch â ni

source: If you need help with this service you can get in touch by telephone or email.
cy: Os ydych angen help efo’r gwasanaeth hwn gallwch gysylltu â ni dros y ffôn neu drwy e-bost.

source: Sorry, there is a problem with the service
cy: Mae’n ddrwg gennym, mae problem gyda’r gwasanaeth

source: Try again later.
cy: Rhowch gynnig arall arni yn nes ymlaen.

source: We’ve not saved any information you entered. When the service is available, you’ll have to <a href="%link%" class="govuk-link">start again.</a>
cy: Nid ydym wedi cadw unrhyw wybodaeth a roddwyd gennych. Pan fydd y gwasanaeth ar gael, bydd rhaid ichi <a href="%link%" class="govuk-link">gychwyn eto.</a>

source: You can <a class="govuk-link" href="%link%">contact us</a> if you have any questions.
cy: Gallwch <a class="govuk-link" href="%link%">gysylltu â ni</a> os oes gennych unrhyw gwestiynau.

source: Page not found
cy: Ni ellir dod o hyd i’r dudalen

source: We could not find the page you're looking for.
cy: Nid oedd modd inni ddod o hyd i’r dudalen yr ydych yn chwilio amdani.

source: If you entered a web address, check it's correct.
cy: Os bu ichi nodi cyfeiriad gwe, gwiriwch eich bod wedi’i nodi’n gywir.

source: You can <a class="govuk-link" href="https://www.gov.uk/">return to GOV.UK</a> or start again.
cy: Gallwch ddychwelyd i <a class="govuk-link" href="https://www.gov.uk/">GOV.UK</a> neu gychwyn eto.

source: <a href="%link%" draggable="false" class="govuk-button">Start again</a>
cy: <a href="%link%" draggable="false" class="govuk-button">Dechrau eto</a>

source: Gone
cy: Wedi mynd

source: This page is no longer available and has been removed permanently.
cy: Nid yw’r dudalen hon ar gael mwyach ac mae wedi’i dileu’n barhaol.

source: Skip to main content
cy: Neidio i’r prif gynnwys

source: This property and finance LPA has been cancelled
cy: Mae’r LPA eiddo ac arian hon wedi ei chanslo

source: This health and welfare LPA has been cancelled
cy: Mae’r LPA iechyd a lles hon wedi ei chanslo

source: Cancelled on %cancellationDate%
cy: Diddymwyd ar %cancellationDate%

source: This property and finance LPA is valid and can be used now
cy: Mae’r atwrneiaeth arhosol hon dros eiddo a materion ariannol yn ddilys a gellir ei defnyddio yn awr

source: This property and finance LPA is valid
cy: Mae’r atwrneiaeth arhosol hon dros eiddo a materion ariannol yn ddilys

source: This health and welfare LPA is valid
cy: Mae’r atwrneiaeth arhosol hon dros iechyd a lles ariannol yn ddilys

source: This <abbr title="lasting power of attorney">LPA</abbr> can only be used when the donor has lost capacity
cy: Ni ellir defnyddio’r <abbr title="atwrneiaethau arhosol">LPA</abbr> hon ond pan nad oes gan y rhoddwr alluedd meddyliol

source: This <abbr title="lasting power of attorney">LPA</abbr> can be used as soon as it's registered unless instructions say otherwise
cy: Gellir defnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon cyn gynted ag y bydd wedi’i chofrestru heblaw bod y cyfarwyddiadau yn dweud fel arall

source: This LPA has instructions and/or preferences
cy: Mae gan yr atwrneiaeth arhosol hon gyfarwyddiadau a/neu ddewisiadau

source: This LPA has instructions and preferences
cy: Mae gan yr atwrneiaeth arhosol hon gyfarwyddiadau a dewisiadau

source: This LPA has preferences
cy: Mae gan yr atwrneiaeth arhosol hon ddewisiadau

source: This LPA has instructions
cy: Mae gan yr atwrneiaeth arhosol hon gyfarwyddiadau

source: You should download and save this LPA summary. You can use it as evidence that you viewed the LPA summary before acting on it.
cy: Dylech lawrlwytho a chadw’r crynodeb LPA hwn. Gallwch ei ddefnyddio fel tystiolaeth eich bod wedi edrych ar y crynodeb LPA cyn gweithredu.

source: Download this LPA summary
cy: Llwytho crynodeb o’r LPA i lawr

source: If any scanned images are not readable, ask the person who gave you the access code to show you the paper LPA.
cy: Os na allwch ddarllen y ddelwedd a sganiwyd, dywedwch wrth yr unigolyn a roddodd y cod mynediad eich bod eisiau gweld yr LPA bapur.

source: I want to check another LPA
cy: Rwyf am wirio LPA arall

source: Day
cy: Dydd

source: Month
cy: Mis

source: Year
cy: Blwyddyn

source: Show
cy: Dangos

source: Hide
cy: Cuddio

source: Cookies on %service_name%
cy: Cwcis ar Wasanaeth %service_name%

source: We use some essential cookies to make this service work.
cy: Rydym yn defnyddio rhai cwcis hanfodol i wneud i’r gwasanaeth hwn weithio.

source: We’d also like to use analytics cookies so we can understand how you use the service and make improvements.
cy: Hoffem hefyd ddefnyddio cwcis dadansoddeg er mwyn i ni allu deall sut rydych chi’n defnyddio’r gwasanaeth a gwneud gwelliannau.

source: Accept analytics cookies
cy: Derbyn cwcis dadansoddeg

source: Reject analytics cookies
cy: Gwrthod cwcis dadansoddeg

source: View cookies
cy: Gweld y cwcis

source: There is a problem
cy: Mae problem

source: Error:
cy: Gwall:

source: When can the <abbr title="lasting power of attorney">LPA</abbr> be used?
cy: Pa bryd y gellir defnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr>?

source: You have said that this <abbr title="lasting power of attorney">LPA</abbr> can be used now. While you have mental capacity, your attorneys can only use the <abbr title="lasting power of attorney">LPA</abbr> if you allow them to.
cy: Rydych wedi dweud y gellir defnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon nawr. Tra bod gennych allu meddyliol, rhaid i’ch atwrneiod gael eich caniatâd chi i ddefnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: The donor has said that this <abbr title="lasting power of attorney">LPA</abbr> can be used now. While the donor has mental capacity, you can only use the <abbr title="lasting power of attorney">LPA</abbr> if the donor allows you to.
cy: Mae’r rhoddwr wedi dweud y gellir defnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr> hon nawr. Tra bod gan y rhoddwr allu meddyliol, rhaid i chi gael caniatâd y rhoddwr i ddefnyddio’r <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: Life-sustaining <br>treatment
cy: Triniaeth <br>cynnal bywyd

source: The attorneys do not have the authority to make decisions about life-sustaining treatment
cy: Nid oes gan yr atwrneiod yr awdurdod i wneud penderfyniadau ynglŷn â thriniaeth cynnal bywyd

source: To view this, ask to see the paper <abbr title="lasting power of attorney">LPA</abbr>
cy: I weld y manylion hyn, gofynnwch am gael gweld y <abbr title="atwrneiaethau arhosol">LPA</abbr> papur

source: Date donor signed <abbr title="lasting power of attorney">LPA</abbr>
cy: Y Dyddiad y llofnododd y rhoddwr yr <abbr title="atwrneiaeth arhosol">LPA</abbr>

source: Registration date
cy: Dyddiad cofrestru

source: <abbr title="lasting power of attorney">LPA</abbr> reference number
cy: Cyfeirnod <abbr title="atwrneiaethau arhosol">LPA</abbr>

source: Yes, the donor made instructions and/or preferences on their LPA.
cy: Oes, mae’r rhoddwr wedi nodi gyfarwyddiadau a/neu ddewisiadau yn ei <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: To view these, ask to see the paper LPA.
cy: Weld y rhain, gofynnwch am gael gweld y <abbr title="atwrneiaeth arhosol">LPA</abbr> papur.

source: Some words in these instructions or preferences have been removed by the court of protection. To check which words have been removed, please ask to see the paper <abbr title="lasting power of attorney">LPA</abbr> or the court order.
cy: Mae rhai geiriau wedi eu tynnu o’r cyfarwyddiadau a’r dewisiadau gan y Llys Gwarchod. I weld pa eiriau a dynnwyd, gofynnwch i gael gweld fersiwn papur o’r Atwrneiaeth Arhosol neu’r Gorchymyn Lly.

source: Preferences
cy: Dymuniadau

source: Yes, the donor made preferences on their LPA.
cy: Oes, mae’r rhoddwr wedi rhoi cyfarwyddiadau yn ei <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: Instructions
cy: Cyfarwyddiadau

source: Yes, the donor set instructions on their LPA.
cy: Oes, mae’r rhoddwr wedi nodi dymuniadau yn ei <abbr title="atwrneiaeth arhosol">LPA</abbr>.

source: The attorneys
cy: Yr atwrneiod

source: How decisions are made
cy: Sut y gwneir penderfyniadau

source: Decisions are made by one attorney
cy: Gwneir penderfyniadau gan un atwrnai

source: Attorneys must make decisions jointly (together)
cy: Rhaid i atwrneiod wneud penderfyniadau ar y cyd (gyda’i gilydd)

source: Attorneys can make decisions jointly (together) and severally (separately)
cy: Gall atwrneiod wneud penderfyniadau ar y cyd (gyda’i gilydd) neu yn annibynnol ar ei gilydd (ar wahân)

source: Attorneys must make some decisions jointly (together) and can make some decisions severally (separately). Check the paper <abbr title="lasting power of attorney">LPA</abbr> to find out what decisions must be made jointly.
cy: Rhaid i atwrneiod wneud rhai penderfyniadau ar y cyd (gyda’i gilydd) ac maent yn gallu gwneud rhai penderfyniadau yn annibynnol ar ei gilydd (ar wahân) Gwiriwch yr <abbr title="atwrneiaeth arhosol">LPA</abbr> papur i gael gwybod pa benderfyniadau y mae’n rhaid eu gwneud ar y cyd.

source: %attorneyOrdinal% attorney
cy: %attorneyOrdinal% atwrnai

source: Also known as
cy: A elwir hefyd yn

source: A scanned copy of the donor’s preferences and/or instructions - the text cannot be digitised at present
cy: Copi wedi ei sganio o’r hyn fyddai orau gan y rhoddwr a/neu ei gyfarwyddiadau- ni ellir digideiddio’r testun ar hyn o bryd

source: Additional Information
cy: Gwybodaeth ychwanegol

source: We are unable to show the preferences for this <abbr title="lasting power of attorney">LPA</abbr>. You’ll need to show the paper <abbr title="lasting power of attorney">LPA</abbr> to anyone who needs to see them.
cy: Ni allwn ddangos y dewisiadau ar gyfer yr Atwrneiaeth Arhosol hon. Bydd angen i chi ddangos yr Atwrneiaeth Arhosol bapur i unrhyw un sydd angen ei gweld.

source: We cannot show the preferences for this <abbr title="lasting power of attorney">LPA</abbr>. Until we can fix this problem, if you need to see these you’ll need to ask the person who gave you the access code to show you the paper <abbr title="lasting power of attorney">LPA</abbr>. You do not need to contact us. We are aware of this issue.
cy: Ni allwn ddangos y dymuniadau ar gyfer y <abbr title="atwrneiaeth arhosol">LPA</abbr> hon. Hyd nes y gallwn ddatrys y broblem hon, os byddwch angen gweld y rhain, bydd rhaid i chi ofyn i’r person a roddodd y cod mynediad i chi i ddangos y <abbr title="atwrneiaeth arhosol">LPA</abbr> bapur i chi. Nid oes angen ichi gysylltu â ni, rydym yn ymwybodol o’r mater hwn.

source: A scanned image of the donor’s preferences will appear here soon. The first time may take up to 10 minutes. You do not need to stay on the page or refresh it whilst you wait.
cy: Bydd delwedd wedi ei sganio o ddewisiadau’r rhoddwr yn ymddangos yma’n fuan. Efallai y bydd yn cymryd hyd at 10 munud y tro cyntaf. Nid oes angen ichi aros ar y dudalen nac adnewyddu’r dudalen wrth ichi aros.

source: A scanned image of the donor’s preferences will appear here soon. The first time may take up to 10 minutes. Please refresh this page.
cy: Bydd delwedd wedi ei sganio o ddewisiadau’r rhoddwr yn ymddangos yma’n fuan. Efallai y bydd yn cymryd hyd at 10 munud y tro cyntaf. Adnewyddwch y dudalen hon os gwelwch yn dda.

source: We are unable to show the instructions for this <abbr title="lasting power of attorney">LPA</abbr>. You’ll need to show the paper <abbr title="lasting power of attorney">LPA</abbr> to anyone who needs to see them.
cy: Ni allwn ddangos y cyfarwyddiadau ar gyfer yr Atwrneiaeth Arhosol hon. Bydd angen i chi ddangos yr Atwrneiaeth Arhosol bapur i unrhyw un sydd angen ei gweld.
